{
  "en": {
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "selected-language": "Language ▾",
    "header-subtitle": "Discover Tenerifa Island",
    "header-title": "Top Restaurants in Tenerife",
    "filter-all": "Show All",
    "filter-yes": "with vegetarian dishes",
    "filter-no": "without vegetarian dishes",
    "sortButton": "Sort Restaurants Alphabetically",
    "medano-title": "Seen By Olivier Tenerife",
    "medano-desc": "Positive vibes and delightful surprises are ready to be discovered at SEEN Beach Club by Olivier Tenerife - the place to be by the sea. Throughout the day, you can savour a leisurely swim and, in the evening, have fun in a lively atmosphere. With a menu designed for sharing delights with friends or enjoying the best fish and meat on the island.",
    "moderate": "Menu :",
    "length": "Seafood",
    "elevation": "Mediterranean",
    "teresitas-title": "Brunelli's Steakhouse",
    "teresitas-desc": "The best steakhouse on this side of the Atlantic, with the most amazing views of the ocean. Our meats, are crispy on the outside and tender on the inside, cooked at 800ºC in our Southbend Grill, unique in the Canary Islands. A splendid steakhouse located close to the entrance to the Loro Parque zoo.",
    "moderate1": "Menu",
    "length1": "American",
    "elevation1": "Steakhouse",
    "duque-title": "El Guanche",
    "duque-desc": "Family Restaurant, since 1971. Traditional Canarian cuisine Vegetarian fusion. 90% Vegetarian. More than a lunch we offer you a culinary experience as you have never lived, in a unique place that offers the Masca Valley. Lovely Restaurant and fantastic homemade food.",
    "hard": "Menu",
    "length2": "Spanish Cuisines",
    "elevation2": "Vegetarian friendly",
    "jimenez-title": "La Torre Del Mirador",
    "jimenez-desc": "La Torre Del Mirador garners praise for its scenic location and breathtaking views, creating a fine dining atmosphere that many guests find justifies the premium prices. While the restaurant's ambiance, enhanced by live music and elegant decor, is frequently celebrated, the food quality receives mixed reviews—some visitors relish the fresh seafood, yet others question the value due to inconsistent preparation.",
    "hard3": "Menu",
    "length3": "Seafood",
    "elevation3": "Vegetarian friendly",
    "camison-title": "Sal Fina",
    "camison-desc": "Sal Fina restaurant has won the hearts of many diners with its eclectic menu that garners praise for burgers and Italian cuisine, though a few have noted a scarcity of Italian options and occasional lapses in dish preparation. Guests have called out the amiable and careful staff, suggesting reservations to navigate its popularity and at times, lengthy service.",
    "moderate4": "Menu",
    "length4": "Italian, Mediterranean",
    "elevation4": "Vegetarian friendly",
    "guios-title": "Trattoría By Royal Hideaway",
    "guios-desc": "Trattoria is a word that comes from \"trattore\", which means to prepare. At the new Trattoria by Il Bocconcino, we prepare our dishes the way Italian mammas cooked them; Homemade pastas and sauces, antipasti, foccacias and delicious pizzas baked by our master pizza maker in a wood-fired oven. All this in a relaxed and informal atmosphere ideal for sharing and enjoying with the family.",
    "hard5": "Menu",
    "length5": "Italian Cusines",
    "elevation5": "Vegetarian friendly",
    "gaviotas-title": "Ibéricos Gastro Bar",
    "gaviotas-desc": "Iberian specialties, as well as different food options, a variety of wines, delicious cocktails, among other drinks, a good atmosphere and excellent service. Ibéricos Gastro Bar emerges as a beloved spot for its exceptional balance of value and quality, with many patrons recommending reservations to secure a taste of their generous, well-spiced dishes like the acclaimed Iberian pork and ham risotto.",
    "hard6": "Menu",
    "length6": "Mediterranean",
    "elevation6": "Vegetarian friendly",
    "benijo-title": "The Bank Steak House",
    "benijo-desc": "The Bank, the restaurant that offers you a unique dining experience the Hotel Villa Cortes, located in Playa de las Americas! Prepare to delight your palate with our unique contemporary approach to an East Coast-inspired steakhouse. While some reviewers mention the steep prices, many agree that the attentive service and flavorful, perfectly prepared steaks justify the cost.",
    "hard7": "Menu",
    "length7": "American",
    "elevation7": "Steakhouse",
    "bodegas-title": "El Rinconcito De Hilario",
    "bodegas-desc": "I have been to this restaurant and I came out fully satisfied! Everything was really very good, from the first to the second, to the desserts. Portions are plentiful, so you come out full and happy. The staff is friendly and attentive, and the welcoming atmosphere makes the experience even more enjoyable. Definitely a place to come back!",
    "hard8": "Menu",
    "length8": "Seafood",
    "elevation8": "Vegetarian friendly",
    "cueva-title": "Guannabí",
    "cueva-desc": "Guannabí is a restaurant located in the old town of Santa Cruz de Tenerife, in an old and typical Canarian house that has been completely renovated achieving a modern and cosmopolitan design, but respecting and maintaining the charm of the rustic and old. It is a place that welcomes you with just entering and added to a menu prepared with great care thus achieving a fusion between Mediterranean cuisine with nuances of Mexican, Peruvian and Asian cuisine.",
    "moderate9": "Menu",
    "length9": "Mediterranean",
    "elevation9": "Vegetarian friendly",
    "tejita-title": "El Gomero",
    "tejita-desc": "Fantastic little restaurant where the locals go, including cops and cab drivers! Its between los christianos and playa de las americas. Lovely local Spanish food. Great variety on the menu and food was so tasty. Waiters was so nice and friendly. Very good variety and quality of products, fast service and all the welcoming and friendly staff.",
    "moderate10": "Menu",
    "length10": "Mediterranean",
    "elevation10": "Vegetarian friendly",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
  },
  "de": {
    "logo": "YourTrip",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Themenwechsel",
    "selected-language": "Sprache ▾",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Die besten Restaurants auf Teneriffa",
    "filter-all": "Alle anzeigen",
    "filter-yes": "mit vegetarischen Gerichten",
    "filter-no": "ohne vegetarische Gerichte",
    "sortButton": "Restaurants alphabetisch sortieren",
    "medano-title": "Seen By Olivier Tenerife",
    "medano-desc": "Positive Vibes und köstliche Überraschungen erwarten Sie im SEEN Beach Club by Olivier Tenerife - dem Ort am Meer. Tagsüber können Sie gemütlich schwimmen und abends in lebhafter Atmosphäre Spaß haben. Mit einer Speisekarte, die zum Teilen von Köstlichkeiten mit Freunden oder zum Genießen des besten Fischs und Fleischs der Insel einlädt.",
    "moderate": "Speisekarte :",
    "length": "Meeresfrüchte",
    "elevation": "Mittelmeerküche",
    "teresitas-title": "Brunelli's Steakhouse",
    "teresitas-desc": "Das beste Steakhaus auf dieser Seite des Atlantiks mit dem atemberaubendsten Blick auf den Ozean. Unsere Fleischgerichte sind außen knusprig und innen zart, zubereitet bei 800°C in unserem Southbend Grill, einzigartig auf den Kanarischen Inseln. Ein prächtiges Steakhaus in der Nähe des Eingangs zum Loro Parque Zoo.",
    "moderate1": "Speisekarte",
    "length1": "Amerikanisch",
    "elevation1": "Steakhouse",
    "duque-title": "El Guanche",
    "duque-desc": "Familienrestaurant seit 1971. Traditionelle kanarische Küche mit vegetarischer Fusion. 90% vegetarisch. Mehr als nur ein Mittagessen bieten wir Ihnen ein kulinarisches Erlebnis, wie Sie es noch nie erlebt haben, an einem einzigartigen Ort im Masca-Tal. Liebevolles Restaurant und fantastisches hausgemachtes Essen.",
    "hard": "Speisekarte",
    "length2": "Spanische Küche",
    "elevation2": "Vegetarisch freundlich",
    "jimenez-title": "La Torre Del Mirador",
    "jimenez-desc": "La Torre Del Mirador erntet Lob für seine malerische Lage und atemberaubende Aussicht, die eine gehobene Atmosphäre schafft, die viele Gäste als den höheren Preis wert empfinden. Während die Atmosphäre des Restaurants, die durch Live-Musik und elegante Dekoration bereichert wird, häufig gelobt wird, erhält die Essensqualität gemischte Bewertungen - einige Besucher genießen die frischen Meeresfrüchte, während andere den Wert aufgrund von ungleichmäßiger Zubereitung in Frage stellen.",
    "hard3": "Speisekarte",
    "length3": "Meeresfrüchte",
    "elevation3": "Vegetarisch freundlich",
    "camison-title": "Sal Fina",
    "camison-desc": "Das Restaurant Sal Fina hat mit seiner vielseitigen Speisekarte die Herzen vieler Gäste erobert, die Burger und italienische Küche loben, obwohl einige eine Knappheit an italienischen Optionen und gelegentliche Mängel bei der Zubereitung der Gerichte festgestellt haben. Gäste haben das freundliche und aufmerksame Personal hervorgehoben und empfehlen Reservierungen, um der Beliebtheit und manchmal langen Wartezeiten zu begegnen.",
    "moderate4": "Speisekarte",
    "length4": "Italienisch, Mittelmeerküche",
    "elevation4": "Vegetarisch freundlich",
    "guios-title": "Trattoría By Royal Hideaway",
    "guios-desc": "Trattoria ist ein Wort, das von \"trattore\" kommt, was \"zubereiten\" bedeutet. In der neuen Trattoria by Il Bocconcino bereiten wir unsere Gerichte so zu, wie italienische Mütter sie gekocht haben; hausgemachte Pasta und Saucen, Antipasti, Foccacias und köstliche Pizzen, die von unserem Pizzameister in einem Holzofen gebacken werden. All dies in einer entspannten und informellen Atmosphäre, die ideal ist, um sie mit der Familie zu teilen und zu genießen.",
    "hard5": "Speisekarte",
    "length5": "Italienische Küche",
    "elevation5": "Vegetarisch freundlich",
    "gaviotas-title": "Ibéricos Gastro Bar",
    "gaviotas-desc": "Iberische Spezialitäten sowie verschiedene Speisen, eine Auswahl an Weinen, köstlichen Cocktails und anderen Getränken, eine gute Atmosphäre und ausgezeichneter Service. Die Ibéricos Gastro Bar ist ein beliebter Ort für ihr außergewöhnliches Preis-Leistungs-Verhältnis, wobei viele Gäste Reservierungen empfehlen, um ihre großzügigen, gut gewürzten Gerichte wie das gefeierte iberische Schweine- und Schinkenrisotto zu probieren.",
    "hard6": "Speisekarte",
    "length6": "Mittelmeerküche",
    "elevation6": "Vegetarisch freundlich",
    "benijo-title": "The Bank Steak House",
    "benijo-desc": "The Bank, das Restaurant, das Ihnen ein einzigartiges kulinarisches Erlebnis im Hotel Villa Cortes in Playa de las Americas bietet! Bereiten Sie sich darauf vor, Ihren Gaumen mit unserem einzigartigen zeitgenössischen Ansatz eines von der Ostküste inspirierten Steakhauses zu verwöhnen. Während einige Rezensenten die hohen Preise erwähnen, sind sich viele einig, dass der aufmerksame Service und die geschmackvollen, perfekt zubereiteten Steaks den Preis rechtfertigen.",
    "hard7": "Speisekarte",
    "length7": "Amerikanisch",
    "elevation7": "Steakhouse",
    "bodegas-title": "El Rinconcito De Hilario",
    "bodegas-desc": "Ich war in diesem Restaurant und kam vollkommen zufrieden heraus! Alles war wirklich sehr gut, von der Vorspeise über die Hauptspeise bis hin zum Dessert. Die Portionen sind reichlich, so dass man satt und glücklich herauskommt. Das Personal ist freundlich und aufmerksam, und die einladende Atmosphäre macht das Erlebnis noch angenehmer. Auf jeden Fall ein Ort, an den man zurückkehren sollte!",
    "hard8": "Speisekarte",
    "length8": "Meeresfrüchte",
    "elevation8": "Vegetarisch freundlich",
    "cueva-title": "Guannabí",
    "cueva-desc": "Guannabí ist ein Restaurant in der Altstadt von Santa Cruz de Tenerife, in einem alten und typischen kanarischen Haus, das komplett renoviert wurde und ein modernes und kosmopolitisches Design aufweist, aber den Charme des Rustikalen und Alten bewahrt. Es ist ein Ort, der Sie schon beim Betreten willkommen heißt und mit einer mit großer Sorgfalt zubereiteten Speisekarte eine Fusion zwischen mediterraner Küche mit Nuancen der mexikanischen, peruanischen und asiatischen Küche bietet.",
    "moderate9": "Speisekarte",
    "length9": "Mittelmeerküche",
    "elevation9": "Vegetarisch freundlich",
    "tejita-title": "El Gomero",
    "tejita-desc": "Fantastisches kleines Restaurant, in das die Einheimischen gehen, einschließlich Polizisten und Taxifahrer! Es liegt zwischen Los Cristianos und Playa de las Americas. Liebevolle lokale spanische Küche. Große Auswahl auf der Speisekarte und das Essen war so lecker. Die Kellner waren so nett und freundlich. Sehr gute Auswahl und Qualität der Produkte, schneller Service und alles sehr einladend und freundlich.",
    "moderate10": "Speisekarte",
    "length10": "Mittelmeerküche",
    "elevation10": "Vegetarisch freundlich",
    "footer-info-title": "Teneriffa erkunden",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte auf Teneriffa zu entdecken - Strände, Wanderungen, Restaurants und versteckte Juwelen - alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
  },
  "es": {
    "logo": "YourTrip",
    "home-link": "Inicio",
    "about-link": "Acerca de",
    "faq-link": "Cambiar tema",
    "selected-language": "Idioma ▾",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Los mejores restaurantes de Tenerife",
    "filter-all": "Mostrar todos",
    "filter-yes": "con platos vegetarianos",
    "filter-no": "sin platos vegetarianos",
    "sortButton": "Ordenar restaurantes alfabéticamente",
    "medano-title": "Seen By Olivier Tenerife",
    "medano-desc": "Vibraciones positivas y deliciosas sorpresas están listas para ser descubiertas en SEEN Beach Club by Olivier Tenerife - el lugar para estar junto al mar. Durante el día, puedes disfrutar de un relajado baño y, por la noche, divertirte en un ambiente animado. Con un menú diseñado para compartir delicias con amigos o disfrutar del mejor pescado y carne de la isla.",
    "moderate": "Menú :",
    "length": "Mariscos",
    "elevation": "Mediterráneo",
    "teresitas-title": "Brunelli's Steakhouse",
    "teresitas-desc": "El mejor steakhouse de este lado del Atlántico, con las vistas más impresionantes del océano. Nuestras carnes, crujientes por fuera y tiernas por dentro, se cocinan a 800ºC en nuestra parrilla Southbend, única en las Islas Canarias. Un espléndido steakhouse ubicado cerca de la entrada al zoológico Loro Parque.",
    "moderate1": "Menú",
    "length1": "Americano",
    "elevation1": "Steakhouse",
    "duque-title": "El Guanche",
    "duque-desc": "Restaurante familiar, desde 1971. Cocina canaria tradicional con fusión vegetariana. 90% vegetariano. Más que un almuerzo, te ofrecemos una experiencia culinaria como nunca antes, en un lugar único que ofrece el Valle de Masca. Encantador restaurante y fantástica comida casera.",
    "hard": "Menú",
    "length2": "Cocina española",
    "elevation2": "Opciones vegetarianas",
    "jimenez-title": "La Torre Del Mirador",
    "jimenez-desc": "La Torre Del Mirador recibe elogios por su ubicación escénica y vistas impresionantes, creando un ambiente de alta cocina que muchos huéspedes consideran que justifica los precios premium. Mientras que el ambiente del restaurante, mejorado con música en vivo y decoración elegante, se celebra con frecuencia, la calidad de la comida recibe críticas mixtas: algunos visitantes disfrutan de los mariscos frescos, mientras que otros cuestionan el valor debido a una preparación inconsistente.",
    "hard3": "Menú",
    "length3": "Mariscos",
    "elevation3": "Opciones vegetarianas",
    "camison-title": "Sal Fina",
    "camison-desc": "El restaurante Sal Fina ha ganado el corazón de muchos comensales con su menú ecléctico que recibe elogios por sus hamburguesas y cocina italiana, aunque algunos han notado una escasez de opciones italianas y lapsos ocasionales en la preparación de los platos. Los clientes han destacado el personal amable y cuidadoso, sugiriendo reservas para navegar su popularidad y, a veces, el servicio prolongado.",
    "moderate4": "Menú",
    "length4": "Italiana, Mediterránea",
    "elevation4": "Opciones vegetarianas",
    "guios-title": "Trattoría By Royal Hideaway",
    "guios-desc": "Trattoria es una palabra que viene de \"trattore\", que significa preparar. En la nueva Trattoria by Il Bocconcino, preparamos nuestros platos como lo hacían las mamás italianas; pastas y salsas caseras, antipasti, foccacias y deliciosas pizzas horneadas por nuestro maestro pizzero en un horno de leña. Todo esto en un ambiente relajado e informal ideal para compartir y disfrutar en familia.",
    "hard5": "Menú",
    "length5": "Cocina italiana",
    "elevation5": "Opciones vegetarianas",
    "gaviotas-title": "Ibéricos Gastro Bar",
    "gaviotas-desc": "Especialidades ibéricas, así como diferentes opciones de comida, una variedad de vinos, deliciosos cócteles, entre otras bebidas, un buen ambiente y un excelente servicio. Ibéricos Gastro Bar surge como un lugar querido por su excepcional equilibrio entre valor y calidad, con muchos clientes recomendando reservas para asegurar un gusto de sus generosos y bien condimentados platos como el aclamado risotto de cerdo ibérico y jamón.",
    "hard6": "Menú",
    "length6": "Mediterránea",
    "elevation6": "Opciones vegetarianas",
    "benijo-title": "The Bank Steak House",
    "benijo-desc": "The Bank, el restaurante que te ofrece una experiencia gastronómica única en el Hotel Villa Cortes, ubicado en Playa de las Américas! Prepárate para deleitar tu paladar con nuestro enfoque contemporáneo único inspirado en los steakhouses de la Costa Este. Mientras algunos críticos mencionan los altos precios, muchos están de acuerdo en que el servicio atento y los sabrosos y perfectamente preparados filetes justifican el costo.",
    "hard7": "Menú",
    "length7": "Americano",
    "elevation7": "Steakhouse",
    "bodegas-title": "El Rinconcito De Hilario",
    "bodegas-desc": "¡He estado en este restaurante y salí completamente satisfecho! Todo estuvo realmente muy bien, desde el primer plato hasta el segundo y los postres. Las porciones son abundantes, así que sales lleno y feliz. El personal es amable y atento, y el ambiente acogedor hace que la experiencia sea aún más agradable. ¡Definitivamente un lugar para volver!",
    "hard8": "Menú",
    "length8": "Mariscos",
    "elevation8": "Opciones vegetarianas",
    "cueva-title": "Guannabí",
    "cueva-desc": "Guannabí es un restaurante ubicado en el casco antiguo de Santa Cruz de Tenerife, en una antigua y típica casa canaria que ha sido completamente renovada logrando un diseño moderno y cosmopolita, pero respetando y manteniendo el encanto de lo rústico y antiguo. Es un lugar que te recibe con solo entrar y se suma a un menú preparado con mucho cuidado logrando así una fusión entre la cocina mediterránea con matices de la cocina mexicana, peruana y asiática.",
    "moderate9": "Menú",
    "length9": "Mediterránea",
    "elevation9": "Opciones vegetarianas",
    "tejita-title": "El Gomero",
    "tejita-desc": "¡Fantástico pequeño restaurante al que van los locales, incluidos policías y taxistas! Está entre Los Cristianos y Playa de las Américas. Encantadora comida local española. Gran variedad en el menú y la comida estaba muy sabrosa. Los camareros eran muy amables y simpáticos. Muy buena variedad y calidad de los productos, servicio rápido y todo el personal muy acogedor y amable.",
    "moderate10": "Menú",
    "length10": "Mediterránea",
    "elevation10": "Opciones vegetarianas",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife: playas, senderos, restaurantes y joyas ocultas, todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin florituras.",
    "footer-contact-title": "Contacto",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
  }
}
