{
  "en": {
    "selected-language": "Language ▾",
    "english-lang": "English",
    "german-lang": "German",
    "spanish-lang": "Spanish",
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "header-subtitle": "Discover Tenerifa Island",
    "header-title": "New Adventure",
    "header-description": "Why Tenerife Is a Paradise for Nature Lovers and Explorers",
    "learn-more-link": "Learn More",
    "beaches-badge": "Top Beaches",
    "beaches-title": "Golden sands, hidden coves, and perfect swim spots await.",
    "hiking-badge": "Top Hiking Trails",
    "hiking-title": "Epic views, volcanic paths, and lush forest routes.",
    "places-badge": "Top Places to Visit",
    "places-title": "Iconic sights, charming towns, and natural wonders.",
    "restaurants-badge": "Top Restaurants",
    "restaurants-title": "Tasty local dishes and unforgettable dining experiences.",
    "viewpoints-badge": "Top Viewpoints",
    "viewpoints-title": "Stunning views, perfect sunsets, and photo-ready spots.",
    "testimonials-title": "Why You Should Definitely Visit Tenerife",
    "testimonials-intro-1": "Tenerife is a captivating island that offers something for everyone— whether you're a nature lover, an adventure seeker, or someone who simply wants to relax and unwind. As the largest of the Canary Islands, Tenerife is blessed with a stunning diversity of landscapes, activities, and experiences that make it a must-visit destination.",
    "testimonials-intro-2": "Here are just a few of the reasons why you should pack your bags and head to Tenerife:",
    "highlight-title-1": "1. Unforgettable Views from Mount Teide",
    "highlight-description-1": "Mount Teide, a UNESCO World Heritage site and Spain's highest peak, is one of the island's biggest attractions. Whether you hike to the summit or take the cable car, the views are truly breathtaking. Standing atop this dormant volcano, you'll have panoramic vistas of the island and the surrounding Atlantic Ocean, making it a perfect spot for photography and a must-see for nature lovers.",
    "highlight-title-2": "2. Spectacular Beaches for Every Taste",
    "highlight-description-2": "Tenerife's beaches offer something for everyone. From the black volcanic sands of Playa Jardín in Puerto de la Cruz to the golden shores of Playa de las Américas, there are plenty of beautiful spots to relax, swim, or indulge in water sports. Whether you're into surfing, kiteboarding, or just lounging by the sea, Tenerife's beaches have you covered.",
    "highlight-title-3": "3. Stunning Hiking Trails",
    "highlight-description-3": "Tenerife is a hiker's paradise, with trails that take you through lush forests, rugged mountains, and coastal cliffs. Explore the Anaga Rural Park, where the ancient laurel forests will make you feel like you've stepped into another world. Or, venture to Masca Valley, a dramatic gorge that offers one of the most scenic hikes on the island.",
    "highlight-title-4": "4. Charming Villages and Local Culture",
    "highlight-description-4": "Tenerife is not just about beaches and mountains—it's also home to charming towns and villages. Stroll through La Orotava, with its cobbled streets and colorful colonial architecture. Don't miss the chance to experience the Carnival of Santa Cruz, one of the largest and most vibrant in the world, where the streets come alive with music, dancing, and colorful costumes.",
    "highlight-title-5": "5. Unique Wildlife and Marine Life",
    "highlight-description-5": "For nature lovers, Tenerife offers opportunities to spot unique wildlife both on land and at sea. The island is a hotspot for birdwatching, where you can spot species like the Canary Islands Kestrel and the Berthelot's Pipit. For a thrilling experience, head out on a boat tour to see whales and dolphins in their natural habitat. The waters around Tenerife are known for being one of the best places in the world to see these magnificent creatures up close.",
    "highlight-title-6": "6. Delicious Local Cuisine",
    "highlight-description-6": "Tenerife offers a rich culinary experience that will tantalize your taste buds. From fresh seafood to traditional Canarian dishes like papas arrugadas (wrinkled potatoes) with mojo sauce, you'll find plenty to savor. Don't forget to try a glass of local wine from the island's vineyards—it's a treat for wine lovers!",
    "highlight-title-7": "7. Year-Round Perfect Weather",
    "highlight-description-7": "Tenerife boasts a subtropical climate, offering sunshine and mild temperatures all year round. Whether you visit in summer or winter, you'll be greeted by warm, pleasant weather, making it a great destination no matter the season.",
    "highlight-title-8": "8. Relaxation and Wellness",
    "highlight-description-8": "If you're looking to relax, Tenerife has many spa resorts and wellness retreats. Enjoy a tranquil day at one of the island's luxurious spa hotels, surrounded by the beauty of nature. The combination of scenic beauty, warm weather, and wellness facilities makes Tenerife an ideal destination for relaxation.",
    "highlight-title-conclusion": "Your Next Adventure Awaits",
    "highlight-description-conclusion": "From the volcanic landscapes of Mount Teide to its pristine beaches and rich cultural heritage, Tenerife offers an unforgettable experience. Whether you're seeking adventure, relaxation, or a little bit of both, this beautiful island has something to offer. Don't miss out on the chance to explore one of Spain's hidden gems—Tenerife is waiting for you!",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
  },
  "es": {
    "selected-language": "Idioma ▾",
    "english-lang": "Inglés",
    "german-lang": "Alemán",
    "spanish-lang": "Español",
    "logo": "YourTrip",
    "home-link": "Inicio",
    "about-link": "Acerca de",
    "faq-link": "Theme Switch",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Nueva aventura",
    "header-description": "Por qué Tenerife es un paraíso para los amantes de la naturaleza y los exploradores",
    "learn-more-link": "Saber más",
    "beaches-badge": "Mejores playas",
    "beaches-title": "Arenas doradas, calas escondidas y lugares perfectos para nadar te esperan.",
    "hiking-badge": "Mejores rutas de senderismo",
    "hiking-title": "Vistas épicas, senderos volcánicos y rutas por frondosos bosques.",
    "places-badge": "Mejores lugares para visitar",
    "places-title": "Lugares icónicos, pueblos encantadores y maravillas naturales.",
    "restaurants-badge": "Mejores restaurantes",
    "restaurants-title": "Platos locales deliciosos y experiencias gastronómicas inolvidables.",
    "viewpoints-badge": "Mejores miradores",
    "viewpoints-title": "Vistas impresionantes, atardeceres perfectos y lugares ideales para fotos.",
    "testimonials-title": "Por qué definitivamente deberías visitar Tenerife",
    "testimonials-intro-1": "Tenerife es una isla cautivadora que ofrece algo para todos: ya sea que seas un amante de la naturaleza, un buscador de aventuras o alguien que simplemente quiere relajarse. Como la más grande de las Islas Canarias, Tenerife cuenta con una impresionante diversidad de paisajes, actividades y experiencias que la convierten en un destino obligado.",
    "testimonials-intro-2": "Aquí hay solo algunas de las razones por las que deberías hacer las maletas y dirigirte a Tenerife:",
    "highlight-title-1": "1. Vistas inolvidables desde el Monte Teide",
    "highlight-description-1": "El Monte Teide, Patrimonio de la Humanidad por la UNESCO y el pico más alto de España, es una de las mayores atracciones de la isla. Ya sea que subas a la cima a pie o en teleférico, las vistas son realmente impresionantes. Desde la cima de este volcán dormido, tendrás vistas panorámicas de la isla y el Océano Atlántico circundante, lo que lo convierte en un lugar perfecto para la fotografía y una visita obligada para los amantes de la naturaleza.",
    "highlight-title-2": "2. Playas espectaculares para todos los gustos",
    "highlight-description-2": "Las playas de Tenerife ofrecen algo para todos. Desde las arenas negras volcánicas de Playa Jardín en Puerto de la Cruz hasta las doradas orillas de Playa de las Américas, hay muchos lugares hermosos para relajarse, nadar o practicar deportes acuáticos. Ya sea que te guste el surf, el kitesurf o simplemente relajarte junto al mar, las playas de Tenerife te lo ofrecen.",
    "highlight-title-3": "3. Impresionantes rutas de senderismo",
    "highlight-description-3": "Tenerife es un paraíso para los senderistas, con rutas que te llevan a través de frondosos bosques, montañas escarpadas y acantilados costeros. Explora el Parque Rural de Anaga, donde los antiguos bosques de laurel te harán sentir como si hubieras entrado en otro mundo. O aventúrate en el Valle de Masca, un desfiladero espectacular que ofrece una de las rutas más pintorescas de la isla.",
    "highlight-title-4": "4. Pueblos encantadores y cultura local",
    "highlight-description-4": "Tenerife no son solo playas y montañas, también alberga pueblos y ciudades encantadoras. Pasea por La Orotava, con sus calles empedradas y colorida arquitectura colonial. No te pierdas la oportunidad de experimentar el Carnaval de Santa Cruz, uno de los más grandes y vibrantes del mundo, donde las calles cobran vida con música, baile y coloridos disfraces.",
    "highlight-title-5": "5. Vida silvestre y marina única",
    "highlight-description-5": "Para los amantes de la naturaleza, Tenerife ofrece oportunidades de avistar vida silvestre única tanto en tierra como en el mar. La isla es un punto caliente para la observación de aves, donde puedes ver especies como el cernícalo de las Canarias y la bisbita caminero. Para una experiencia emocionante, realiza un tour en barco para ver ballenas y delfines en su hábitat natural. Las aguas alrededor de Tenerife son conocidas por ser uno de los mejores lugares del mundo para ver estas magníficas criaturas de cerca.",
    "highlight-title-6": "6. Deliciosa gastronomía local",
    "highlight-description-6": "Tenerife ofrece una rica experiencia culinaria que deleitará tu paladar. Desde mariscos frescos hasta platos tradicionales canarios como las papas arrugadas con mojo, encontrarás mucho que saborear. No olvides probar una copa de vino local de los viñedos de la isla—¡es un placer para los amantes del vino!",
    "highlight-title-7": "7. Clima perfecto todo el año",
    "highlight-description-7": "Tenerife presume de un clima subtropical, ofreciendo sol y temperaturas suaves durante todo el año. Ya sea que visites en verano o invierno, te recibirá un clima cálido y agradable, lo que lo convierte en un gran destino sin importar la temporada.",
    "highlight-title-8": "8. Relajación y bienestar",
    "highlight-description-8": "Si buscas relajarte, Tenerife tiene muchos resorts de spa y centros de bienestar. Disfruta de un día tranquilo en uno de los lujosos hoteles spa de la isla, rodeado de la belleza de la naturaleza. La combinación de belleza escénica, clima cálido e instalaciones de bienestar hacen de Tenerife un destino ideal para la relajación.",
    "highlight-title-conclusion": "Tu próxima aventura te espera",
    "highlight-description-conclusion": "Desde los paisajes volcánicos del Teide hasta sus playas vírgenes y su rico patrimonio cultural, Tenerife ofrece una experiencia inolvidable. Ya sea que busques aventura, relajación o un poco de ambas, esta hermosa isla tiene algo que ofrecer. No pierdas la oportunidad de explorar una de las joyas ocultas de España—¡Tenerife te espera!",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin relleno.",
    "footer-contact-title": "Contacto",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
  },
  "de": {
    "selected-language": "Sprache ▾",
    "english-lang": "Englisch",
    "german-lang": "Deutsch",
    "spanish-lang": "Spanisch",
    "logo": "YourTrip",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Theme Switch",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Neues Abenteuer",
    "header-description": "Warum Teneriffa ein Paradies für Naturliebhaber und Entdecker ist",
    "learn-more-link": "Mehr erfahren",
    "beaches-badge": "Top Strände",
    "beaches-title": "Goldener Sand, versteckte Buchten und perfekte Schwimmstellen warten auf Sie.",
    "hiking-badge": "Top Wanderwege",
    "hiking-title": "Eindrucksvolle Aussichten, vulkanische Pfade und üppige Waldrouten.",
    "places-badge": "Top Sehenswürdigkeiten",
    "places-title": "Ikönische Sehenswürdigkeiten, charmante Städte und Naturwunder.",
    "restaurants-badge": "Top Restaurants",
    "restaurants-title": "Köstliche lokale Gerichte und unvergessliche kulinarische Erlebnisse.",
    "viewpoints-badge": "Top Aussichtspunkte",
    "viewpoints-title": "Atemberaubende Aussichten, perfekte Sonnenuntergänge und fotogene Orte.",
    "testimonials-title": "Warum Sie unbedingt Teneriffa besuchen sollten",
    "testimonials-intro-1": "Teneriffa ist eine faszinierende Insel, die für jeden etwas bietet – ob Sie Naturliebhaber, Abenteurer sind oder einfach nur entspannen möchten. Als größte der Kanarischen Inseln verfügt Teneriffa über eine beeindruckende Vielfalt an Landschaften, Aktivitäten und Erlebnissen, die es zu einem Muss machen.",
    "testimonials-intro-2": "Hier sind nur einige Gründe, warum Sie Ihre Koffer packen und nach Teneriffa reisen sollten:",
    "highlight-title-1": "1. Unvergessliche Aussichten vom Teide",
    "highlight-description-1": "Der Teide, ein UNESCO-Weltkulturerbe und der höchste Berg Spaniens, ist eine der größten Attraktionen der Insel. Ob Sie zum Gipfel wandern oder die Seilbahn nehmen, die Aussicht ist atemberaubend. Von diesem schlafenden Vulkan aus haben Sie einen Panoramablick auf die Insel und den umliegenden Atlantik, was ihn zu einem perfekten Ort für Fotografie und ein Muss für Naturliebhaber macht.",
    "highlight-title-2": "2. Spektakuläre Strände für jeden Geschmack",
    "highlight-description-2": "Die Strände Teneriffas bieten für jeden etwas. Von den schwarzen Vulkansänden der Playa Jardín in Puerto de la Cruz bis zu den goldenen Küsten der Playa de las Américas gibt es viele schöne Orte zum Entspannen, Schwimmen oder Wassersport. Ob Sie surfen, kitesurfen oder einfach nur am Meer entspannen möchten – Teneriffas Strände haben alles.",
    "highlight-title-3": "3. Atemberaubende Wanderwege",
    "highlight-description-3": "Teneriffa ist ein Wanderparadies mit Pfaden durch üppige Wälder, zerklüftete Berge und Küstenklippen. Erkunden Sie den Anaga Rural Park, wo die uralten Lorbeerwälder Sie in eine andere Welt versetzen. Oder begeben Sie sich ins Masca-Tal, eine dramatische Schlucht mit einer der landschaftlich schönsten Wanderungen der Insel.",
    "highlight-title-4": "4. Charmante Dörfer und lokale Kultur",
    "highlight-description-4": "Teneriffa besteht nicht nur aus Stränden und Bergen – es beherbergt auch charmante Städte und Dörfer. Schlendern Sie durch La Orotava mit seinen Kopfsteinpflasterstraßen und farbenfroher Kolonialarchitektur. Verpassen Sie nicht den Karneval von Santa Cruz, einen der größten und lebendigsten der Welt, wo die Straßen mit Musik, Tanz und farbenfrohen Kostümen zum Leben erwachen.",
    "highlight-title-5": "5. Einzigartige Tier- und Meereswelt",
    "highlight-description-5": "Für Naturliebhaber bietet Teneriffa die Möglichkeit, einzigartige Tierwelt an Land und im Meer zu beobachten. Die Insel ist ein Hotspot für Vogelbeobachtung, wo Sie Arten wie den Kanaren-Turmfalken und den Kanarenpieper sehen können. Für ein aufregendes Erlebnis unternehmen Sie eine Bootstour, um Wale und Delfine in ihrem natürlichen Lebensraum zu sehen. Die Gewässer rund um Teneriffa gehören zu den besten Orten der Welt, um diese majestätischen Kreaturen aus nächster Nähe zu beobachten.",
    "highlight-title-6": "6. Köstliche lokale Küche",
    "highlight-description-6": "Teneriffa bietet ein reiches kulinarisches Erlebnis, das Ihre Geschmacksknospen verwöhnt. Von frischen Meeresfrüchten bis zu traditionellen kanarischen Gerichten wie papas arrugadas (Runzelkartoffeln) mit Mojo-Sauce finden Sie viel zu genießen. Vergessen Sie nicht, ein Glas lokalen Wein aus den Weingütern der Insel zu probieren – ein Genuss für Weinliebhaber!",
    "highlight-title-7": "7. Ganzjährig perfektes Wetter",
    "highlight-description-7": "Teneriffa verfügt über ein subtropisches Klima mit Sonnenschein und milden Temperaturen das ganze Jahr über. Egal, ob Sie im Sommer oder Winter kommen, Sie werden von warmem, angenehmem Wetter begrüßt, was es zu einem großartigen Reiseziel macht, unabhängig von der Jahreszeit.",
    "highlight-title-8": "8. Entspannung und Wellness",
    "highlight-description-8": "Wenn Sie sich entspannen möchten, hat Teneriffa viele Spa-Resorts und Wellness-Retreats. Genießen Sie einen ruhigen Tag in einem der luxuriösen Spa-Hotels der Insel, umgeben von der Schönheit der Natur. Die Kombination aus landschaftlicher Schönheit, warmem Wetter und Wellness-Einrichtungen macht Teneriffa zu einem idealen Ziel zur Entspannung.",
    "highlight-title-conclusion": "Ihr nächstes Abenteuer wartet",
    "highlight-description-conclusion": "Von den vulkanischen Landschaften des Teide über die unberührten Strände bis zum reichen Kulturerbe bietet Teneriffa ein unvergessliches Erlebnis. Ob Sie Abenteuer, Entspannung oder beides suchen – diese wunderschöne Insel hat etwas zu bieten. Verpassen Sie nicht die Chance, eines der versteckten Juwelen Spaniens zu erkunden – Teneriffa wartet auf Sie!",
    "footer-logo": "YourTrip",
    "footer-info-title": "Teneriffa erkunden",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden – Strände, Wanderungen, Restaurants und versteckte Juwelen – alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
  }
}
