{
  "home": {
    "en": {
      "selected-language": "Language ▾",
      "english-lang": "English",
      "german-lang": "German",
      "spanish-lang": "Spanish",
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "header-subtitle": "Discover Tenerifa Island",
      "header-title": "New Adventure",
      "header-description": "Why Tenerife Is a Paradise for Nature Lovers and Explorers",
      "learn-more-link": "Learn More",
      "beaches-badge": "Top Beaches",
      "beaches-title": "Golden sands, hidden coves, and perfect swim spots await.",
      "hiking-badge": "Top Hiking Trails",
      "hiking-title": "Epic views, volcanic paths, and lush forest routes.",
      "places-badge": "Top Places to Visit",
      "places-title": "Iconic sights, charming towns, and natural wonders.",
      "restaurants-badge": "Top Restaurants",
      "restaurants-title": "Tasty local dishes and unforgettable dining experiences.",
      "viewpoints-badge": "Top Viewpoints",
      "viewpoints-title": "Stunning views, perfect sunsets, and photo-ready spots.",
      "testimonials-title": "Why You Should Definitely Visit Tenerife",
      "testimonials-intro-1": "Tenerife is a captivating island that offers something for everyone— whether you're a nature lover, an adventure seeker, or someone who simply wants to relax and unwind. As the largest of the Canary Islands, Tenerife is blessed with a stunning diversity of landscapes, activities, and experiences that make it a must-visit destination.",
      "testimonials-intro-2": "Here are just a few of the reasons why you should pack your bags and head to Tenerife:",
      "highlight-title-1": "1. Unforgettable Views from Mount Teide",
      "highlight-description-1": "Mount Teide, a UNESCO World Heritage site and Spain's highest peak, is one of the island's biggest attractions. Whether you hike to the summit or take the cable car, the views are truly breathtaking. Standing atop this dormant volcano, you'll have panoramic vistas of the island and the surrounding Atlantic Ocean, making it a perfect spot for photography and a must-see for nature lovers.",
      "highlight-title-2": "2. Spectacular Beaches for Every Taste",
      "highlight-description-2": "Tenerife's beaches offer something for everyone. From the black volcanic sands of Playa Jardín in Puerto de la Cruz to the golden shores of Playa de las Américas, there are plenty of beautiful spots to relax, swim, or indulge in water sports. Whether you're into surfing, kiteboarding, or just lounging by the sea, Tenerife's beaches have you covered.",
      "highlight-title-3": "3. Stunning Hiking Trails",
      "highlight-description-3": "Tenerife is a hiker's paradise, with trails that take you through lush forests, rugged mountains, and coastal cliffs. Explore the Anaga Rural Park, where the ancient laurel forests will make you feel like you've stepped into another world. Or, venture to Masca Valley, a dramatic gorge that offers one of the most scenic hikes on the island.",
      "highlight-title-4": "4. Charming Villages and Local Culture",
      "highlight-description-4": "Tenerife is not just about beaches and mountains—it's also home to charming towns and villages. Stroll through La Orotava, with its cobbled streets and colorful colonial architecture. Don't miss the chance to experience the Carnival of Santa Cruz, one of the largest and most vibrant in the world, where the streets come alive with music, dancing, and colorful costumes.",
      "highlight-title-5": "5. Unique Wildlife and Marine Life",
      "highlight-description-5": "For nature lovers, Tenerife offers opportunities to spot unique wildlife both on land and at sea. The island is a hotspot for birdwatching, where you can spot species like the Canary Islands Kestrel and the Berthelot's Pipit. For a thrilling experience, head out on a boat tour to see whales and dolphins in their natural habitat. The waters around Tenerife are known for being one of the best places in the world to see these magnificent creatures up close.",
      "highlight-title-6": "6. Delicious Local Cuisine",
      "highlight-description-6": "Tenerife offers a rich culinary experience that will tantalize your taste buds. From fresh seafood to traditional Canarian dishes like papas arrugadas (wrinkled potatoes) with mojo sauce, you'll find plenty to savor. Don't forget to try a glass of local wine from the island's vineyards—it's a treat for wine lovers!",
      "highlight-title-7": "7. Year-Round Perfect Weather",
      "highlight-description-7": "Tenerife boasts a subtropical climate, offering sunshine and mild temperatures all year round. Whether you visit in summer or winter, you'll be greeted by warm, pleasant weather, making it a great destination no matter the season.",
      "highlight-title-8": "8. Relaxation and Wellness",
      "highlight-description-8": "If you're looking to relax, Tenerife has many spa resorts and wellness retreats. Enjoy a tranquil day at one of the island's luxurious spa hotels, surrounded by the beauty of nature. The combination of scenic beauty, warm weather, and wellness facilities makes Tenerife an ideal destination for relaxation.",
      "highlight-title-conclusion": "Your Next Adventure Awaits",
      "highlight-description-conclusion": "From the volcanic landscapes of Mount Teide to its pristine beaches and rich cultural heritage, Tenerife offers an unforgettable experience. Whether you're seeking adventure, relaxation, or a little bit of both, this beautiful island has something to offer. Don't miss out on the chance to explore one of Spain's hidden gems—Tenerife is waiting for you!",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
    },
    "es": {
      "selected-language": "Idioma ▾",
      "english-lang": "Inglés",
      "german-lang": "Alemán",
      "spanish-lang": "Español",
      "logo": "YourTrip",
      "home-link": "Inicio",
      "about-link": "Acerca de",
      "faq-link": "Theme Switch",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Nueva aventura",
      "header-description": "Por qué Tenerife es un paraíso para los amantes de la naturaleza y los exploradores",
      "learn-more-link": "Saber más",
      "beaches-badge": "Mejores playas",
      "beaches-title": "Arenas doradas, calas escondidas y lugares perfectos para nadar te esperan.",
      "hiking-badge": "Mejores rutas de senderismo",
      "hiking-title": "Vistas épicas, senderos volcánicos y rutas por frondosos bosques.",
      "places-badge": "Mejores lugares para visitar",
      "places-title": "Lugares icónicos, pueblos encantadores y maravillas naturales.",
      "restaurants-badge": "Mejores restaurantes",
      "restaurants-title": "Platos locales deliciosos y experiencias gastronómicas inolvidables.",
      "viewpoints-badge": "Mejores miradores",
      "viewpoints-title": "Vistas impresionantes, atardeceres perfectos y lugares ideales para fotos.",
      "testimonials-title": "Por qué definitivamente deberías visitar Tenerife",
      "testimonials-intro-1": "Tenerife es una isla cautivadora que ofrece algo para todos: ya sea que seas un amante de la naturaleza, un buscador de aventuras o alguien que simplemente quiere relajarse. Como la más grande de las Islas Canarias, Tenerife cuenta con una impresionante diversidad de paisajes, actividades y experiencias que la convierten en un destino obligado.",
      "testimonials-intro-2": "Aquí hay solo algunas de las razones por las que deberías hacer las maletas y dirigirte a Tenerife:",
      "highlight-title-1": "1. Vistas inolvidables desde el Monte Teide",
      "highlight-description-1": "El Monte Teide, Patrimonio de la Humanidad por la UNESCO y el pico más alto de España, es una de las mayores atracciones de la isla. Ya sea que subas a la cima a pie o en teleférico, las vistas son realmente impresionantes. Desde la cima de este volcán dormido, tendrás vistas panorámicas de la isla y el Océano Atlántico circundante, lo que lo convierte en un lugar perfecto para la fotografía y una visita obligada para los amantes de la naturaleza.",
      "highlight-title-2": "2. Playas espectaculares para todos los gustos",
      "highlight-description-2": "Las playas de Tenerife ofrecen algo para todos. Desde las arenas negras volcánicas de Playa Jardín en Puerto de la Cruz hasta las doradas orillas de Playa de las Américas, hay muchos lugares hermosos para relajarse, nadar o practicar deportes acuáticos. Ya sea que te guste el surf, el kitesurf o simplemente relajarte junto al mar, las playas de Tenerife te lo ofrecen.",
      "highlight-title-3": "3. Impresionantes rutas de senderismo",
      "highlight-description-3": "Tenerife es un paraíso para los senderistas, con rutas que te llevan a través de frondosos bosques, montañas escarpadas y acantilados costeros. Explora el Parque Rural de Anaga, donde los antiguos bosques de laurel te harán sentir como si hubieras entrado en otro mundo. O aventúrate en el Valle de Masca, un desfiladero espectacular que ofrece una de las rutas más pintorescas de la isla.",
      "highlight-title-4": "4. Pueblos encantadores y cultura local",
      "highlight-description-4": "Tenerife no son solo playas y montañas, también alberga pueblos y ciudades encantadoras. Pasea por La Orotava, con sus calles empedradas y colorida arquitectura colonial. No te pierdas la oportunidad de experimentar el Carnaval de Santa Cruz, uno de los más grandes y vibrantes del mundo, donde las calles cobran vida con música, baile y coloridos disfraces.",
      "highlight-title-5": "5. Vida silvestre y marina única",
      "highlight-description-5": "Para los amantes de la naturaleza, Tenerife ofrece oportunidades de avistar vida silvestre única tanto en tierra como en el mar. La isla es un punto caliente para la observación de aves, donde puedes ver especies como el cernícalo de las Canarias y la bisbita caminero. Para una experiencia emocionante, realiza un tour en barco para ver ballenas y delfines en su hábitat natural. Las aguas alrededor de Tenerife son conocidas por ser uno de los mejores lugares del mundo para ver estas magníficas criaturas de cerca.",
      "highlight-title-6": "6. Deliciosa gastronomía local",
      "highlight-description-6": "Tenerife ofrece una rica experiencia culinaria que deleitará tu paladar. Desde mariscos frescos hasta platos tradicionales canarios como las papas arrugadas con mojo, encontrarás mucho que saborear. No olvides probar una copa de vino local de los viñedos de la isla—¡es un placer para los amantes del vino!",
      "highlight-title-7": "7. Clima perfecto todo el año",
      "highlight-description-7": "Tenerife presume de un clima subtropical, ofreciendo sol y temperaturas suaves durante todo el año. Ya sea que visites en verano o invierno, te recibirá un clima cálido y agradable, lo que lo convierte en un gran destino sin importar la temporada.",
      "highlight-title-8": "8. Relajación y bienestar",
      "highlight-description-8": "Si buscas relajarte, Tenerife tiene muchos resorts de spa y centros de bienestar. Disfruta de un día tranquilo en uno de los lujosos hoteles spa de la isla, rodeado de la belleza de la naturaleza. La combinación de belleza escénica, clima cálido e instalaciones de bienestar hacen de Tenerife un destino ideal para la relajación.",
      "highlight-title-conclusion": "Tu próxima aventura te espera",
      "highlight-description-conclusion": "Desde los paisajes volcánicos del Teide hasta sus playas vírgenes y su rico patrimonio cultural, Tenerife ofrece una experiencia inolvidable. Ya sea que busques aventura, relajación o un poco de ambas, esta hermosa isla tiene algo que ofrecer. No pierdas la oportunidad de explorar una de las joyas ocultas de España—¡Tenerife te espera!",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin relleno.",
      "footer-contact-title": "Contacto",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
    },
    "de": {
      "selected-language": "Sprache ▾",
      "english-lang": "Englisch",
      "german-lang": "Deutsch",
      "spanish-lang": "Spanisch",
      "logo": "YourTrip",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Theme Switch",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Neues Abenteuer",
      "header-description": "Warum Teneriffa ein Paradies für Naturliebhaber und Entdecker ist",
      "learn-more-link": "Mehr erfahren",
      "beaches-badge": "Top Strände",
      "beaches-title": "Goldener Sand, versteckte Buchten und perfekte Schwimmstellen warten auf Sie.",
      "hiking-badge": "Top Wanderwege",
      "hiking-title": "Eindrucksvolle Aussichten, vulkanische Pfade und üppige Waldrouten.",
      "places-badge": "Top Sehenswürdigkeiten",
      "places-title": "Ikönische Sehenswürdigkeiten, charmante Städte und Naturwunder.",
      "restaurants-badge": "Top Restaurants",
      "restaurants-title": "Köstliche lokale Gerichte und unvergessliche kulinarische Erlebnisse.",
      "viewpoints-badge": "Top Aussichtspunkte",
      "viewpoints-title": "Atemberaubende Aussichten, perfekte Sonnenuntergänge und fotogene Orte.",
      "testimonials-title": "Warum Sie unbedingt Teneriffa besuchen sollten",
      "testimonials-intro-1": "Teneriffa ist eine faszinierende Insel, die für jeden etwas bietet – ob Sie Naturliebhaber, Abenteurer sind oder einfach nur entspannen möchten. Als größte der Kanarischen Inseln verfügt Teneriffa über eine beeindruckende Vielfalt an Landschaften, Aktivitäten und Erlebnissen, die es zu einem Muss machen.",
      "testimonials-intro-2": "Hier sind nur einige Gründe, warum Sie Ihre Koffer packen und nach Teneriffa reisen sollten:",
      "highlight-title-1": "1. Unvergessliche Aussichten vom Teide",
      "highlight-description-1": "Der Teide, ein UNESCO-Weltkulturerbe und der höchste Berg Spaniens, ist eine der größten Attraktionen der Insel. Ob Sie zum Gipfel wandern oder die Seilbahn nehmen, die Aussicht ist atemberaubend. Von diesem schlafenden Vulkan aus haben Sie einen Panoramablick auf die Insel und den umliegenden Atlantik, was ihn zu einem perfekten Ort für Fotografie und ein Muss für Naturliebhaber macht.",
      "highlight-title-2": "2. Spektakuläre Strände für jeden Geschmack",
      "highlight-description-2": "Die Strände Teneriffas bieten für jeden etwas. Von den schwarzen Vulkansänden der Playa Jardín in Puerto de la Cruz bis zu den goldenen Küsten der Playa de las Américas gibt es viele schöne Orte zum Entspannen, Schwimmen oder Wassersport. Ob Sie surfen, kitesurfen oder einfach nur am Meer entspannen möchten – Teneriffas Strände haben alles.",
      "highlight-title-3": "3. Atemberaubende Wanderwege",
      "highlight-description-3": "Teneriffa ist ein Wanderparadies mit Pfaden durch üppige Wälder, zerklüftete Berge und Küstenklippen. Erkunden Sie den Anaga Rural Park, wo die uralten Lorbeerwälder Sie in eine andere Welt versetzen. Oder begeben Sie sich ins Masca-Tal, eine dramatische Schlucht mit einer der landschaftlich schönsten Wanderungen der Insel.",
      "highlight-title-4": "4. Charmante Dörfer und lokale Kultur",
      "highlight-description-4": "Teneriffa besteht nicht nur aus Stränden und Bergen – es beherbergt auch charmante Städte und Dörfer. Schlendern Sie durch La Orotava mit seinen Kopfsteinpflasterstraßen und farbenfroher Kolonialarchitektur. Verpassen Sie nicht den Karneval von Santa Cruz, einen der größten und lebendigsten der Welt, wo die Straßen mit Musik, Tanz und farbenfrohen Kostümen zum Leben erwachen.",
      "highlight-title-5": "5. Einzigartige Tier- und Meereswelt",
      "highlight-description-5": "Für Naturliebhaber bietet Teneriffa die Möglichkeit, einzigartige Tierwelt an Land und im Meer zu beobachten. Die Insel ist ein Hotspot für Vogelbeobachtung, wo Sie Arten wie den Kanaren-Turmfalken und den Kanarenpieper sehen können. Für ein aufregendes Erlebnis unternehmen Sie eine Bootstour, um Wale und Delfine in ihrem natürlichen Lebensraum zu sehen. Die Gewässer rund um Teneriffa gehören zu den besten Orten der Welt, um diese majestätischen Kreaturen aus nächster Nähe zu beobachten.",
      "highlight-title-6": "6. Köstliche lokale Küche",
      "highlight-description-6": "Teneriffa bietet ein reiches kulinarisches Erlebnis, das Ihre Geschmacksknospen verwöhnt. Von frischen Meeresfrüchten bis zu traditionellen kanarischen Gerichten wie papas arrugadas (Runzelkartoffeln) mit Mojo-Sauce finden Sie viel zu genießen. Vergessen Sie nicht, ein Glas lokalen Wein aus den Weingütern der Insel zu probieren – ein Genuss für Weinliebhaber!",
      "highlight-title-7": "7. Ganzjährig perfektes Wetter",
      "highlight-description-7": "Teneriffa verfügt über ein subtropisches Klima mit Sonnenschein und milden Temperaturen das ganze Jahr über. Egal, ob Sie im Sommer oder Winter kommen, Sie werden von warmem, angenehmem Wetter begrüßt, was es zu einem großartigen Reiseziel macht, unabhängig von der Jahreszeit.",
      "highlight-title-8": "8. Entspannung und Wellness",
      "highlight-description-8": "Wenn Sie sich entspannen möchten, hat Teneriffa viele Spa-Resorts und Wellness-Retreats. Genießen Sie einen ruhigen Tag in einem der luxuriösen Spa-Hotels der Insel, umgeben von der Schönheit der Natur. Die Kombination aus landschaftlicher Schönheit, warmem Wetter und Wellness-Einrichtungen macht Teneriffa zu einem idealen Ziel zur Entspannung.",
      "highlight-title-conclusion": "Ihr nächstes Abenteuer wartet",
      "highlight-description-conclusion": "Von den vulkanischen Landschaften des Teide über die unberührten Strände bis zum reichen Kulturerbe bietet Teneriffa ein unvergessliches Erlebnis. Ob Sie Abenteuer, Entspannung oder beides suchen – diese wunderschöne Insel hat etwas zu bieten. Verpassen Sie nicht die Chance, eines der versteckten Juwelen Spaniens zu erkunden – Teneriffa wartet auf Sie!",
      "footer-logo": "YourTrip",
      "footer-info-title": "Teneriffa erkunden",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden – Strände, Wanderungen, Restaurants und versteckte Juwelen – alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
    }
  },
  "beaches": {
    "en": {
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "selected-language": "Language ▾",
      "header-subtitle": "Discover Tenerifa Island",
      "header-title": "Top beaches on Tenerife",
      "filterDropdownButton": "Filter",
      "filter-all": "Show All",
      "filter-yes": "With Infrastructure",
      "filter-no": "Without Infrastructure",
      "sortButton": "Sort Beaches Alphabetically",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
      "medano-title": "El Médano",
      "medano-desc": "A popular destination for its ideal wind conditions, Playa del Médano is a renowned spot for water sports. With its fine sand and shallow waters, it's ideal for families and thrill-seekers alike. We loved the stunning view of Montaña Roja. It's a beach that invites relaxation and contemplation.",
      "teresitas-title": "Las Teresitas",
      "teresitas-desc": "This magnificent beach of golden sand imported from the Sahara, stretching for almost a kilometer, is one of the region's jewels. We particularly appreciate its gentle, gradual slope as you enter the water. It's perfect for a family outing with swimming, water polo, beach volleyball, pedal boats and other modern facilities.",
      "duque-title": "Duque",
      "duque-desc": "Fine golden sand and calm turquoise waters: this well-kept beach offers a luxurious setting, surrounded by high-end hotels and chic boutiques. This beautiful extended beach is divided into 2: Playa del Duque North and Playa del Duque South. It is well equipped.",
      "jimenez-title": "Jiménez",
      "jimenez-desc": "Playa Jimenez is our favorite in Puerto de la Cruz. It is the furthest from the center. You can recognize it by the colorful facades at the end of the promenade overlooking it. We went there in the early hours of the morning and really appreciated its peaceful atmosphere.",
      "camison-title": "Del Camison",
      "camison-desc": "Playa del Camison pleasantly surprised us with its charm. This small beach of golden sand, nestled between two rocky promontories, offers calm, crystal-clear waters. We appreciated its family atmosphere and proximity to amenities, while remaining away from the hustle and bustle of the big seaside resorts.",
      "guios-title": "Los Guios",
      "guios-desc": "Located at the foot of the impressive Los Gigantes cliffs, Playa de Los Guios offers a breathtaking setting. We were fascinated by the volcanic rock walls overlooking the beach. One section was closed at the time of our visit due to falling rocks. Playa de Los Guyos is also the ideal starting point for water sports activities.",
      "gaviotas-title": "Las Gaviotas",
      "gaviotas-desc": "This beautiful black sand beach is a little corner of paradise surrounded by impressive cliffs. We were won over by the natural, unspoilt setting of Playa de Las Gaviotas. Although the TF-121 road leading to it is narrow and winding, it's well worth the detour. We fell under the spell of this haven of peace, cut off from the world.",
      "benijo-title": "Benijo",
      "benijo-desc": "Playa del Benijo seduced us with its wild beauty and secluded atmosphere. This black sand and pebble beach offers breathtaking scenery with its spectacular rock formations and sculpted cliffs.",
      "bodegas-title": "Roque de las Bodeguas",
      "bodegas-desc": "In the Anaga massif, we were really seduced by this wild beach with its deep black sand, a far cry from the touristy beaches of the south. On one side the view of the Anaga cliffs, on the other a rocky promontory that gives it its name.",
      "cueva-title": "Cueva del Agua",
      "cueva-desc": "This secluded beach, to the east of Playa de La Gaviotas, is one of our favorites hidden away in the Anaga massif. We were seduced by its fine black sand and natural charm. Although unsupervised and unequipped, it offers good swimming conditions.",
      "tejita-title": "Tejita",
      "tejita-desc": "Playa de la Tejita won us over with its natural, unspoilt character. One of Tenerife's largest natural beaches, this long golden sandy beach offers a spectacular setting with the Roja mountain in the background."
    },
    "de": {
      "logo": "IhreReise",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Themenwechsel",
      "selected-language": "Sprache ▾",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Die besten Strände auf Teneriffa",
      "filterDropdownButton": "Filter",
      "filter-all": "Alle anzeigen",
      "filter-yes": "Mit Infrastruktur",
      "filter-no": "Ohne Infrastruktur",
      "sortButton": "Strände alphabetisch sortieren",
      "footer-logo": "IhreReise",
      "footer-info-title": "Teneriffa erkunden",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hallo@entdecketeneriffa.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
      "medano-title": "El Médano",
      "medano-desc": "Ein beliebtes Ziel aufgrund seiner idealen Windverhältnisse ist Playa del Médano, ein bekannter Ort für Wassersport. Mit seinem feinen Sand und flachen Wasser ist er ideal für Familien und Abenteurer gleichermaßen. Wir liebten den atemberaubenden Blick auf den Montaña Roja. Es ist ein Strand, der zur Entspannung und Besinnung einlädt.",
      "teresitas-title": "Las Teresitas",
      "teresitas-desc": "Dieser prächtige Strand mit goldenem Sand aus der Sahara, der sich fast einen Kilometer erstreckt, ist eines der Juwelen der Region. Wir schätzen besonders den sanften, allmählichen Abfall beim Betreten des Wassers. Er ist perfekt für einen Familienausflug mit Schwimmen, Wasserball, Beachvolleyball, Tretbooten und anderen modernen Einrichtungen.",
      "duque-title": "Duque",
      "duque-desc": "Feiner goldener Sand und ruhiges türkisfarbenes Wasser: Dieser gepflegte Strand bietet eine luxuriöse Umgebung, umgeben von erstklassigen Hotels und schicken Boutiquen. Dieser schöne, weitläufige Strand ist in zwei Teile geteilt: Playa del Duque Norte und Playa del Duque Sur. Er ist gut ausgestattet.",
      "jimenez-title": "Jiménez",
      "jimenez-desc": "Playa Jimenez ist unser Favorit in Puerto de la Cruz. Es ist der am weitesten vom Zentrum entfernte Strand. Man erkennt ihn an den bunten Fassaden am Ende der Promenade mit Blick darauf. Wir waren in den frühen Morgenstunden dort und schätzten die friedliche Atmosphäre sehr.",
      "camison-title": "Del Camison",
      "camison-desc": "Playa del Camison hat uns angenehm mit ihrem Charme überrascht. Dieser kleine Strand mit goldenem Sand, eingebettet zwischen zwei felsigen Landspitzen, bietet ruhiges, kristallklares Wasser. Wir schätzten das Familienambiente und die Nähe zu Annehmlichkeiten, während er dennoch abseits des Trubels der großen Badeorte liegt.",
      "guios-title": "Los Guios",
      "guios-desc": "Am Fuße der beeindruckenden Los Gigantes-Klippen gelegen, bietet Playa de Los Guios eine atemberaubende Kulisse. Wir waren fasziniert von den vulkanischen Felswänden, die den Strand überragen. Ein Abschnitt war zum Zeitpunkt unseres Besuchs wegen Steinschlags gesperrt. Playa de Los Guyos ist auch der ideale Ausgangspunkt für Wassersportaktivitäten.",
      "gaviotas-title": "Las Gaviotas",
      "gaviotas-desc": "Dieser schöne schwarze Sandstrand ist ein kleines Paradies, umgeben von beeindruckenden Klippen. Wir waren begeistert von der natürlichen, unberührten Umgebung der Playa de Las Gaviotas. Obwohl die TF-121-Straße dorthin schmal und kurvenreich ist, lohnt sich der Umweg. Wir verfielen dem Zauber dieses friedlichen Ortes, abgeschnitten von der Welt.",
      "benijo-title": "Benijo",
      "benijo-desc": "Playa del Benijo hat uns mit seiner wilden Schönheit und abgeschiedenen Atmosphäre verzaubert. Dieser schwarze Sand- und Kieselstrand bietet atemberaubende Landschaften mit spektakulären Felsformationen und geformten Klippen.",
      "bodegas-title": "Roque de las Bodeguas",
      "bodegas-desc": "Im Anaga-Gebirge waren wir wirklich verzaubert von diesem wilden Strand mit seinem tiefschwarzen Sand, weit entfernt von den touristischen Stränden des Südens. Auf der einen Seite der Blick auf die Anaga-Klippen, auf der anderen ein felsiges Vorgebirge, das ihm seinen Namen gibt.",
      "cueva-title": "Cueva del Agua",
      "cueva-desc": "Dieser abgelegene Strand östlich der Playa de La Gaviotas ist einer unserer Favoriten, versteckt im Anaga-Gebirge. Wir waren begeistert von seinem feinen schwarzen Sand und natürlichen Charme. Obwohl unbeaufsichtigt und ohne Ausstattung, bietet er gute Badebedingungen.",
      "tejita-title": "Tejita",
      "tejita-desc": "Playa de la Tejita hat uns mit ihrem natürlichen, unberührten Charakter überzeugt. Einer der größten Naturstrände Teneriffas, dieser lange goldene Sandstrand bietet eine spektakuläre Kulisse mit dem Berg Roja im Hintergrund."
    },
    "es": {
      "logo": "TuViaje",
      "home-link": "Inicio",
      "about-link": "Acerca de",
      "faq-link": "Cambiar tema",
      "selected-language": "Idioma ▾",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Las mejores playas de Tenerife",
      "filterDropdownButton": "Filtrar",
      "filter-all": "Mostrar todo",
      "filter-yes": "Con infraestructura",
      "filter-no": "Sin infraestructura",
      "sortButton": "Ordenar playas alfabéticamente",
      "footer-logo": "TuViaje",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía insular definitiva, sin florituras.",
      "footer-contact-title": "Contacto",
      "footer-email": "hola@exploratenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
      "medano-title": "El Médano",
      "medano-desc": "Un destino popular por sus condiciones de viento ideales, Playa del Médano es un lugar reconocido para deportes acuáticos. Con su arena fina y aguas poco profundas, es ideal tanto para familias como para buscadores de emociones. Nos encantó la impresionante vista del Montaña Roja. Es una playa que invita a la relajación y la contemplación.",
      "teresitas-title": "Las Teresitas",
      "teresitas-desc": "Esta magnífica playa de arena dorada importada del Sáhara, que se extiende casi un kilómetro, es una de las joyas de la región. Apreciamos especialmente su suave pendiente gradual al entrar al agua. Es perfecta para una salida familiar con natación, waterpolo, voleibol playero, pedales y otras instalaciones modernas.",
      "duque-title": "Duque",
      "duque-desc": "Arena fina dorada y aguas turquesas tranquilas: esta playa bien cuidada ofrece un entorno lujoso, rodeado de hoteles de alta gama y boutiques elegantes. Esta hermosa playa extendida se divide en 2: Playa del Duque Norte y Playa del Duque Sur. Está bien equipada.",
      "jimenez-title": "Jiménez",
      "jimenez-desc": "Playa Jimenez es nuestra favorita en Puerto de la Cruz. Es la más alejada del centro. Puedes reconocerla por las fachadas coloridas al final del paseo marítimo que la rodea. Fuimos allí en las primeras horas de la mañana y realmente apreciamos su ambiente tranquilo.",
      "camison-title": "Del Camison",
      "camison-desc": "Playa del Camison nos sorprendió gratamente con su encanto. Esta pequeña playa de arena dorada, enclavada entre dos promontorios rocosos, ofrece aguas tranquilas y cristalinas. Apreciamos su ambiente familiar y cercanía a los servicios, manteniéndose alejada del bullicio de los grandes complejos turísticos.",
      "guios-title": "Los Guios",
      "guios-desc": "Situada al pie de los impresionantes acantilados de Los Gigantes, Playa de Los Guios ofrece un entorno impresionante. Nos fascinaron las paredes de roca volcánica que dominan la playa. Una sección estaba cerrada durante nuestra visita debido a desprendimientos de rocas. Playa de Los Guyos es también el punto de partida ideal para actividades deportivas acuáticas.",
      "gaviotas-title": "Las Gaviotas",
      "gaviotas-desc": "Esta hermosa playa de arena negra es un pequeño rincón del paraíso rodeado de impresionantes acantilados. Nos conquistó el entorno natural y virgen de Playa de Las Gaviotas. Aunque la carretera TF-121 que lleva hasta ella es estrecha y sinuosa, merece la pena el desvío. Caímos bajo el hechizo de este remanso de paz, aislado del mundo.",
      "benijo-title": "Benijo",
      "benijo-desc": "Playa del Benijo nos sedujo con su belleza salvaje y ambiente apartado. Esta playa de arena negra y guijarros ofrece paisajes impresionantes con sus espectaculares formaciones rocosas y acantilados esculpidos.",
      "bodegas-title": "Roque de las Bodegas",
      "bodegas-desc": "En el macizo de Anaga, quedamos realmente seducidos por esta playa salvaje con su arena negra profunda, muy lejos de las playas turísticas del sur. Por un lado la vista de los acantilados de Anaga, por el otro un promontorio rocoso que le da su nombre.",
      "cueva-title": "Cueva del Agua",
      "cueva-desc": "Esta playa apartada, al este de Playa de La Gaviotas, es una de nuestras favoritas escondidas en el macizo de Anaga. Nos sedujo su arena negra fina y encanto natural. Aunque no está vigilada ni equipada, ofrece buenas condiciones para nadar.",
      "tejita-title": "Tejita",
      "tejita-desc": "Playa de la Tejita nos conquistó con su carácter natural y virgen. Una de las playas naturales más grandes de Tenerife, esta larga playa de arena dorada ofrece un escenario espectacular con la montaña Roja al fondo."
    }
  },
  "hiking": {
    "en": {
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "selected-language": "Language ▾",
      "header-subtitle": "Discover Tenerife Island",
      "header-title": "Top Hiking Trails on Tenerife",
      "filterDropdownButton": "Filter",
      "filter-all": "Show All",
      "filter-yes": "Hard Trails",
      "filter-no": "Moderate Trails",
      "sortButton": "Sort Trails Alphabetically",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best hiking trails — from volcanic landscapes to lush forests — all in one place. Your ultimate hiking guide to the island.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
      "moderate": "Moderate",
      "hard": "Hard",
      "length": "Length",
      "elevation": "Elevation",
      "moderate1": "Moderate",
      "hard1": "Hard",
      "length1": "Length",
      "elevation1": "Elevation",
      "moderate2": "Moderate",
      "hard2": "Hard",
      "length2": "Length",
      "elevation2": "Elevation",
      "moderate3": "Moderate",
      "hard3": "Hard",
      "length3": "Length",
      "elevation3": "Elevation",
      "moderate4": "Moderate",
      "hard4": "Hard",
      "length4": "Length",
      "elevation4": "Elevation",
      "moderate5": "Moderate",
      "hard5": "Hard",
      "length5": "Length",
      "elevation5": "Elevation",
      "moderate6": "Moderate",
      "hard6": "Hard",
      "length6": "Length",
      "elevation6": "Elevation",
      "moderate7": "Moderate",
      "hard7": "Hard",
      "length7": "Length",
      "elevation7": "Elevation",
      "moderate8": "Moderate",
      "hard8": "Hard",
      "length8": "Length",
      "elevation8": "Elevation",
      "moderate9": "Moderate",
      "hard9": "Hard",
      "length9": "Length",
      "elevation9": "Elevation",
      "moderate10": "Moderate",
      "hard10": "Hard",
      "length10": "Length",
      "elevation10": "Elevation",
      "medano-title": "Roques de García",
      "medano-desc": "Discover this 3.4-km loop trail near Vilaflor, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime. Dogs are welcome, but must be on a leash.",
      "teresitas-title": "Chinyero Volcano",
      "teresitas-desc": "Discover this 8.2-km loop trail near Santiago del Teide, Tenerife. Generally considered a moderately challenging route, it takes an average of 2 h 15 min to complete. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "duque-title": "Cruz del Draguillo",
      "duque-desc": "Experience this 5.1-km loop trail near Santa Cruz de Tenerife, Tenerife. Generally considered a challenging route, it takes an average of 2 h 33 min to complete. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime. Dogs are welcome and may be off-leash in some areas.",
      "jimenez-title": "Montaña Blanca",
      "jimenez-desc": "Discover this 10.9-km point-to-point trail near El Portillo, Tenerife. Generally considered a challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "camison-title": "Chinamada",
      "camison-desc": "Experience this 7.6-km loop trail near San Cristóbal de La Laguna, Tenerife. Generally considered a moderately challenging route, it takes an average of 2 h 35 min to complete. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The best times to visit this trail are November through May.",
      "guios-title": "Mount Guajara",
      "guios-desc": "Head out on this 11.1-km loop trail near Vilaflor, Tenerife. Generally considered a challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "gaviotas-title": "Hidalgo Point",
      "gaviotas-desc": "Experience this 9.5-km out-and-back trail near Tegueste, Tenerife. Generally considered a challenging route, it takes an average of 4 h 0 min to complete. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "benijo-title": "Callejón de Teno",
      "benijo-desc": "Head out on this 10.0-km loop trail near Buenavista del Norte, Tenerife. Generally considered a moderately challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "bodegas-title": "Taborno Rock",
      "bodegas-desc": "Get to know this 3.9-km loop trail near Santa Cruz de Tenerife, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "cueva-title": "Sendero de los Sentidos",
      "cueva-desc": "Head out on this 1.3-km loop trail near Tegueste, Tenerife. Generally considered a moderately challenging route, it takes an average of 31 min to complete. This is a very popular area for walking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
      "tejita-title": "Santiago del Teide",
      "tejita-desc": "Check out this 8.9-km point-to-point trail near Santiago del Teide, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The best times to visit this trail are November through April."
    },
    "de": {
      "logo": "IhreReise",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Themenwechsel",
      "selected-language": "Sprache ▾",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Die besten Wanderwege auf Teneriffa",
      "filterDropdownButton": "Filter",
      "filter-all": "Alle anzeigen",
      "filter-yes": "Schwierige Wanderwege",
      "filter-no": "Mittelschwere Wanderwege",
      "sortButton": "Wanderwege alphabetisch sortieren",
      "footer-logo": "IhreReise",
      "footer-info-title": "Teneriffa erkunden",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Wanderwege Teneriffas zu erkunden — von vulkanischen Landschaften bis zu üppigen Wäldern — alles an einem Ort. Ihr ultimativer Wanderführer für die Insel.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hallo@entdecketeneriffa.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
      "moderate": "Mittel",
      "hard": "Schwer",
      "length": "Länge",
      "elevation": "Höhenunterschied",
      "moderate1": "Mittel",
      "hard1": "Schwer",
      "length1": "Länge",
      "elevation1": "Höhenunterschied",
      "moderate2": "Mittel",
      "hard2": "Schwer",
      "length2": "Länge",
      "elevation2": "Höhenunterschied",
      "moderate3": "Mittel",
      "hard3": "Schwer",
      "length3": "Länge",
      "elevation3": "Höhenunterschied",
      "moderate4": "Mittel",
      "hard4": "Schwer",
      "length4": "Länge",
      "elevation4": "Höhenunterschied",
      "moderate5": "Mittel",
      "hard5": "Schwer",
      "length5": "Länge",
      "elevation5": "Höhenunterschied",
      "moderate6": "Mittel",
      "hard6": "Schwer",
      "length6": "Länge",
      "elevation6": "Höhenunterschied",
      "moderate7": "Mittel",
      "hard7": "Schwer",
      "length7": "Länge",
      "elevation7": "Höhenunterschied",
      "moderate8": "Mittel",
      "hard8": "Schwer",
      "length8": "Länge",
      "elevation8": "Höhenunterschied",
      "moderate9": "Mittel",
      "hard9": "Schwer",
      "length9": "Länge",
      "elevation9": "Höhenunterschied",
      "moderate10": "Mittel",
      "hard10": "Schwer",
      "length10": "Länge",
      "elevation10": "Höhenunterschied",
      "medano-title": "Roques de García",
      "medano-desc": "Entdecken Sie diesen 3,4 km langen Rundweg in der Nähe von Vilaflor, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen. Hunde sind erlaubt, müssen aber an der Leine geführt werden.",
      "teresitas-title": "Chinyero Vulkan",
      "teresitas-desc": "Entdecken Sie diesen 8,2 km langen Rundweg in der Nähe von Santiago del Teide, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 15 Minuten. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "duque-title": "Cruz del Draguillo",
      "duque-desc": "Erleben Sie diesen 5,1 km langen Rundweg in der Nähe von Santa Cruz de Tenerife, Teneriffa. Allgemein als anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 33 Minuten. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen. Hunde sind erlaubt und dürfen in einigen Bereichen ohne Leine laufen.",
      "jimenez-title": "Montaña Blanca",
      "jimenez-desc": "Entdecken Sie diesen 10,9 km langen Streckenweg in der Nähe von El Portillo, Teneriffa. Allgemein als anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "camison-title": "Chinamada",
      "camison-desc": "Erleben Sie diesen 7,6 km langen Rundweg in der Nähe von San Cristóbal de La Laguna, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 35 Minuten. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Die beste Zeit für diesen Weg ist von November bis Mai.",
      "guios-title": "Mount Guajara",
      "guios-desc": "Begeben Sie sich auf diesen 11,1 km langen Rundweg in der Nähe von Vilaflor, Teneriffa. Allgemein als anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "gaviotas-title": "Hidalgo Point",
      "gaviotas-desc": "Erleben Sie diesen 9,5 km langen Hin- und Rückweg in der Nähe von Tegueste, Teneriffa. Allgemein als anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 4 Stunden. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "benijo-title": "Callejón de Teno",
      "benijo-desc": "Begeben Sie sich auf diesen 10,0 km langen Rundweg in der Nähe von Buenavista del Norte, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "bodegas-title": "Taborno Rock",
      "bodegas-desc": "Lernen Sie diesen 3,9 km langen Rundweg in der Nähe von Santa Cruz de Tenerife, Teneriffa kennen. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "cueva-title": "Sendero de los Sentidos",
      "cueva-desc": "Begeben Sie sich auf diesen 1,3 km langen Rundweg in der Nähe von Tegueste, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 31 Minuten. Dies ist ein sehr beliebtes Gebiet zum Spazierengehen, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
      "tejita-title": "Santiago del Teide",
      "tejita-desc": "Sehen Sie sich diesen 8,9 km langen Streckenweg in der Nähe von Santiago del Teide, Teneriffa an. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Die beste Zeit für diesen Weg ist von November bis April."
    },
    "es": {
      "logo": "TuViaje",
      "home-link": "Inicio",
      "about-link": "Acerca de",
      "faq-link": "Cambiar tema",
      "selected-language": "Idioma ▾",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Los mejores senderos de Tenerife",
      "filterDropdownButton": "Filtrar",
      "filter-all": "Mostrar todo",
      "filter-yes": "Rutas difíciles",
      "filter-no": "Rutas moderadas",
      "sortButton": "Ordenar senderos alfabéticamente",
      "footer-logo": "TuViaje",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores senderos de Tenerife — desde paisajes volcánicos hasta frondosos bosques — todo en un solo lugar. Tu guía definitiva de senderismo en la isla.",
      "footer-contact-title": "Contacto",
      "footer-email": "hola@exploratenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
      "moderate": "Moderado",
      "hard": "Difícil",
      "length": "Longitud",
      "elevation": "Desnivel",
      "moderate1": "Moderado",
      "hard1": "Difícil",
      "length1": "Longitud",
      "elevation1": "Desnivel",
      "moderate2": "Moderado",
      "hard2": "Difícil",
      "length2": "Longitud",
      "elevation2": "Desnivel",
      "moderate3": "Moderado",
      "hard3": "Difícil",
      "length3": "Longitud",
      "elevation3": "Desnivel",
      "moderate4": "Moderado",
      "hard4": "Difícil",
      "length4": "Longitud",
      "elevation4": "Desnivel",
      "moderate5": "Moderado",
      "hard5": "Difícil",
      "length5": "Longitud",
      "elevation5": "Desnivel",
      "moderate6": "Moderado",
      "hard6": "Difícil",
      "length6": "Longitud",
      "elevation6": "Desnivel",
      "moderate7": "Moderado",
      "hard7": "Difícil",
      "length7": "Longitud",
      "elevation7": "Desnivel",
      "moderate8": "Moderado",
      "hard8": "Difícil",
      "length8": "Longitud",
      "elevation8": "Desnivel",
      "moderate9": "Moderado",
      "hard9": "Difícil",
      "length9": "Longitud",
      "elevation9": "Desnivel",
      "moderate10": "Moderado",
      "hard10": "Difícil",
      "length10": "Longitud",
      "elevation10": "Desnivel",
      "medano-title": "Roques de García",
      "medano-desc": "Descubre este sendero circular de 3,4 km cerca de Vilaflor, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento. Se permiten perros, pero deben ir con correa.",
      "teresitas-title": "Volcán Chinyero",
      "teresitas-desc": "Descubre este sendero circular de 8,2 km cerca de Santiago del Teide, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 2 horas y 15 minutos en completarla. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "duque-title": "Cruz del Draguillo",
      "duque-desc": "Experimenta este sendero circular de 5,1 km cerca de Santa Cruz de Tenerife, Tenerife. Generalmente considerado como una ruta desafiante, se tarda una media de 2 horas y 33 minutos en completarla. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento. Se permiten perros y pueden estar sin correa en algunas áreas.",
      "jimenez-title": "Montaña Blanca",
      "jimenez-desc": "Descubre este sendero de punto a punto de 10,9 km cerca de El Portillo, Tenerife. Generalmente considerado como una ruta desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "camison-title": "Chinamada",
      "camison-desc": "Experimenta este sendero circular de 7,6 km cerca de San Cristóbal de La Laguna, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 2 horas y 35 minutos en completarla. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. Los mejores momentos para visitar este sendero son de noviembre a mayo.",
      "guios-title": "Mount Guajara",
      "guios-desc": "Adéntrate en este sendero circular de 11,1 km cerca de Vilaflor, Tenerife. Generalmente considerado como una ruta desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "gaviotas-title": "Hidalgo Point",
      "gaviotas-desc": "Experimenta este sendero de ida y vuelta de 9,5 km cerca de Tegueste, Tenerife. Generalmente considerado como una ruta desafiante, se tarda una media de 4 horas en completarla. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "benijo-title": "Callejón de Teno",
      "benijo-desc": "Adéntrate en este sendero circular de 10,0 km cerca de Buenavista del Norte, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "bodegas-title": "Taborno Rock",
      "bodegas-desc": "Conoce este sendero circular de 3,9 km cerca de Santa Cruz de Tenerife, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "cueva-title": "Sendero de los Sentidos",
      "cueva-desc": "Adéntrate en este sendero circular de 1,3 km cerca de Tegueste, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 31 minutos en completarla. Esta es un área muy popular para caminar, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
      "tejita-title": "Santiago del Teide",
      "tejita-desc": "Echa un vistazo a este sendero de punto a punto de 8,9 km cerca de Santiago del Teide, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. Los mejores momentos para visitar este sendero son de noviembre a abril."
    }
  },
  "places": {
    "en": {
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "selected-language": "Language ▾",
      "header-subtitle": "Discover Tenerifa Island",
      "header-title": "Top Places to Visit",
      "sortButton": "Sort Places Alphabetically",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
      "medano-title": "San Cristobal La Laguna",
      "medano-desc": "San Cristobal La Laguna, a UNESCO World Heritage site, is a town that impressed us deeply with its historic charm. Its wide cobbled streets and colorful colonial buildings bear witness to a rich past. We were transported back in time. The city is also home to numerous churches and convents, including the majestic Cathedral of Nuestra Señora de los Remedios.",
      "teresitas-title": "La Orotava",
      "teresitas-desc": "La Orotava, nestled in a fertile valley, is an architectural gem, with houses featuring finely crafted wooden balconies that bear witness to a rich colonial past. The Casa de los Balcones is a remarkable example of traditional Canarian architecture. She charmed us. The town offers a mix of gardens, churches and historic buildings.",
      "duque-title": "Masca",
      "duque-desc": "Now here’s a completely different experience. Masca is a tiny village perched in the Teno mountains. It’s the most picturesque in Tenerife. We were captivated by its spectacular location, nestled in a landscape of vertiginous gorges. In addition to the spectacular scenery, the traditional stone houses, clinging to the mountainside, are charming.",
      "jimenez-title": "Puerto de la Cruz",
      "jimenez-desc": "Puerto de la Cruz, a historic seaside resort in northern Tenerife, harmoniously combines colonial charm with modern attractions. We were seduced by the relaxed atmosphere of its historic center and waterfront. Between gardens, churches, typical houses and street art, you can sit on the terraces of many cafés to enjoy this unique mix.",
      "camison-title": "Candelaria",
      "camison-desc": "Candelaria, famous for its imposing basilica dedicated to the Virgin of Candelaria, patron saint of the Canary Islands, is an essential place of pilgrimage. It really is at the heart of the city and its culture. This oceanfront basilica is adorned with monumental statues representing the Guanche kings. We also particularly enjoyed the promenade along the waterfront, with its statues and black sandy beach.",
      "guios-title": "Vilaflor",
      "guios-desc": "Vilaflor, in the hills above Tenerife, offers a magnificent natural setting. Surrounded by pine forests, it is the ideal starting point for numerous hikes in the Teide National Park. We were charmed by the peaceful atmosphere of its narrow streets. The 17th-century church of San Pedro is the historic heart of the village. And wine lovers will appreciate the surrounding vineyards.",
      "gaviotas-title": "Garachico",
      "gaviotas-desc": "Garachico, the former capital of Tenerife, is a town that won us over with its historic charm and natural surroundings. It was rebuilt after a volcanic eruption in the 18th century. We loved the combination of the few historic buildings with the view of the cliffs and lava formations. By the sea, this creates natural pools.",
      "benijo-title": "Santa Cruz de Tenerife",
      "benijo-desc": "Santa Cruz de Tenerife, the island’s capital, is a dynamic city offering a blend of modernity and tradition. From one neighborhood to the next, the experience varies greatly. We particularly enjoyed the Tenerife auditorium, designed by Santiago Calatrava. This architectural masterpiece dominates the waterfront.",
      "bodegas-title": "Icod de los Vinos",
      "bodegas-desc": "Icod de los Vinos is famous for its thousand-year-old dragon tree. But it’s also a dynamic city with other tourist attractions, but full of locals. The historic heart of the town has well-preserved colonial buildings, and the park around the Drago Milenario offers an enchanting interlude.",
      "cueva-title": "Buenavista",
      "cueva-desc": "Buenavista is a quiet little town with colorful houses and a pretty church. Above all, it is the gateway to the Punta de Teno volcanic zone at the foot of the giant cliffs. The combination of landscapes is magnificent.",
      "tejita-title": "Tenerife Carnival",
      "tejita-desc": "Tenerife Carnival has three events that you really shouldn’t miss: the gala to select the Carnival Queen, where contestants compete in terms of glamour and imaginative costume to achieve a place of honour; the Cabalgata [Procession], in which the people take part in their finest costumes; and the Coso, the grand procession along the seafront, with carnival queens and their maids of honour, floats and music groups. A spectacular climax, and not to be missed if you want a great time."
    },
    "de": {
      "logo": "YourTrip",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Themenwechsel",
      "selected-language": "Sprache ▾",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Top Sehenswürdigkeiten",
      "sortButton": "Orte alphabetisch sortieren",
      "footer-logo": "YourTrip",
      "footer-info-title": "Teneriffa erkunden",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu entdecken — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hallo@entdecketeneriffa.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
      "medano-title": "San Cristóbal de La Laguna",
      "medano-desc": "San Cristóbal de La Laguna, ein UNESCO-Weltkulturerbe, ist eine Stadt, die uns mit ihrem historischen Charm tief beeindruckt hat. Ihre breiten Kopfsteinpflasterstraßen und bunten Kolonialgebäude zeugen von einer reichen Vergangenheit. Wir fühlten uns in eine andere Zeit versetzt. Die Stadt beherbergt auch zahlreiche Kirchen und Klöster, darunter die majestätische Kathedrale Nuestra Señora de los Remedios.",
      "teresitas-title": "La Orotava",
      "teresitas-desc": "La Orotava, eingebettet in ein fruchtbares Tal, ist ein architektonisches Juwel mit Häusern, die kunstvoll geschnitzte Holzbalkone aufweisen und von einer reichen Kolonialvergangenheit zeugen. Die Casa de los Balcones ist ein bemerkenswertes Beispiel traditioneller kanarischer Architektur. Sie hat uns verzaubert. Die Stadt bietet eine Mischung aus Gärten, Kirchen und historischen Gebäuden.",
      "duque-title": "Masca",
      "duque-desc": "Hier erwartet Sie ein völlig anderes Erlebnis. Masca ist ein winziges Dorf in den Teno-Bergen. Es ist das malerischste auf Teneriffa. Wir waren fasziniert von seiner spektakulären Lage, eingebettet in eine Landschaft aus schwindelerregenden Schluchten. Neben der atemberaubenden Landschaft sind die traditionellen Steinhäuser, die sich an den Berghang schmiegen, einfach bezaubernd.",
      "jimenez-title": "Puerto de la Cruz",
      "jimenez-desc": "Puerto de la Cruz, ein historischer Badeort im Norden Teneriffas, verbindet kolonialen Charme harmonisch mit modernen Attraktionen. Wir waren begeistert von der entspannten Atmosphäre seines historischen Zentrums und der Uferpromenade. Zwischen Gärten, Kirchen, typischen Häusern und Street Art kann man in vielen Cafés sitzen und diese einzigartige Mischung genießen.",
      "camison-title": "Candelaria",
      "camison-desc": "Candelaria, berühmt für seine imposante Basilika, die der Jungfrau von Candelaria, der Schutzpatronin der Kanarischen Inseln, gewidmet ist, ist ein wichtiger Pilgerort. Sie steht wirklich im Herzen der Stadt und ihrer Kultur. Diese Basilika am Meer ist mit monumentalen Statuen geschmückt, die die Guanchen-Könige darstellen. Besonders genossen haben wir auch den Spaziergang entlang der Uferpromenade mit ihren Statuen und dem schwarzen Sandstrand.",
      "guios-title": "Vilaflor",
      "guios-desc": "Vilaflor, in den Hügeln Teneriffas gelegen, bietet eine wunderschöne natürliche Umgebung. Umgeben von Pinienwäldern ist es der ideale Ausgangspunkt für zahlreiche Wanderungen im Teide-Nationalpark. Wir waren begeistert von der friedlichen Atmosphäre seiner engen Gassen. Die Kirche San Pedro aus dem 17. Jahrhundert ist das historische Herz des Dorfes. Und Weinliebhaber werden die umliegenden Weinberge zu schätzen wissen.",
      "gaviotas-title": "Garachico",
      "gaviotas-desc": "Garachico, die ehemalige Hauptstadt Teneriffas, ist eine Stadt, die uns mit ihrem historischen Charme und ihrer natürlichen Umgebung begeistert hat. Sie wurde nach einem Vulkanausbruch im 18. Jahrhundert wieder aufgebaut. Wir liebten die Kombination der wenigen historischen Gebäude mit dem Blick auf die Klippen und Lavafelder. Am Meer entstehen so natürliche Pools.",
      "benijo-title": "Santa Cruz de Tenerife",
      "benijo-desc": "Santa Cruz de Tenerife, die Hauptstadt der Insel, ist eine dynamische Stadt, die Moderne und Tradition verbindet. Von einem Viertel zum nächsten variiert das Erlebnis stark. Wir haben besonders das Auditorio de Tenerife, entworfen von Santiago Calatrava, genossen. Dieses architektonische Meisterwerk dominiert die Uferpromenade.",
      "bodegas-title": "Icod de los Vinos",
      "bodegas-desc": "Icod de los Vinos ist berühmt für seinen tausendjährigen Drachenbaum. Aber es ist auch eine lebendige Stadt mit anderen touristischen Attraktionen, aber voller Einheimischer. Das historische Herz der Stadt verfügt über gut erhaltene Kolonialgebäude, und der Park um den Drago Milenario bietet ein bezauberndes Intermezzo.",
      "cueva-title": "Buenavista",
      "cueva-desc": "Buenavista ist ein ruhiges Städtchen mit bunten Häusern und einer hübschen Kirche. Vor allem ist es das Tor zur vulkanischen Zone Punta de Teno am Fuße der riesigen Klippen. Die Kombination der Landschaften ist wunderschön.",
      "tejita-title": "Karneval auf Teneriffa",
      "tejita-desc": "Der Karneval auf Teneriffa hat drei Ereignisse, die Sie wirklich nicht verpassen sollten: die Gala zur Wahl der Karnevalskönigin, bei der die Teilnehmerinnen um Glamour und einfallsreiche Kostüme wetteifern, um einen Ehrenplatz zu erhalten; die Cabalgata [Umzug], bei der die Menschen in ihren schönsten Kostümen teilnehmen; und der Coso, der große Umzug entlang der Uferpromenade mit Karnevalsköniginnen, Hofdamen, Festwagen und Musikgruppen. Ein spektakulärer Höhepunkt, den Sie nicht verpassen sollten, wenn Sie eine tolle Zeit haben möchten."
    },
    "es": {
      "logo": "YourTrip",
      "home-link": "Inicio",
      "about-link": "Sobre nosotros",
      "faq-link": "Cambiar tema",
      "selected-language": "Idioma ▾",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Los mejores lugares para visitar",
      "sortButton": "Ordenar lugares alfabéticamente",
      "footer-logo": "YourTrip",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin rodeos.",
      "footer-contact-title": "Contacto",
      "footer-email": "hola@exploratenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
      "medano-title": "San Cristóbal de La Laguna",
      "medano-desc": "San Cristóbal de La Laguna, Patrimonio de la Humanidad por la UNESCO, es una ciudad que nos impresionó profundamente con su encanto histórico. Sus calles empedradas y coloridos edificios coloniales dan testimonio de un pasado rico. Nos transportamos a otra época. La ciudad también alberga numerosas iglesias y conventos, incluida la majestuosa Catedral de Nuestra Señora de los Remedios.",
      "teresitas-title": "La Orotava",
      "teresitas-desc": "La Orotava, enclavada en un valle fértil, es una joya arquitectónica, con casas que presentan balcones de madera finamente tallados que dan testimonio de un rico pasado colonial. La Casa de los Balcones es un ejemplo notable de la arquitectura tradicional canaria. Nos encantó. El pueblo ofrece una mezcla de jardines, iglesias y edificios históricos.",
      "duque-title": "Masca",
      "duque-desc": "Aquí tienes una experiencia completamente diferente. Masca es un pequeño pueblo encaramado en las montañas de Teno. Es el más pintoresco de Tenerife. Nos cautivó su ubicación espectacular, enclavado en un paisaje de gargantas vertiginosas. Además del paisaje espectacular, las casas tradicionales de piedra, aferradas a la ladera de la montaña, son encantadoras.",
      "jimenez-title": "Puerto de la Cruz",
      "jimenez-desc": "Puerto de la Cruz, un histórico balneario marítimo en el norte de Tenerife, combina armoniosamente el encanto colonial con atracciones modernas. Nos sedujo el ambiente relajado de su centro histórico y el paseo marítimo. Entre jardines, iglesias, casas típicas y arte callejero, puedes sentarte en las terrazas de muchos cafés para disfrutar de esta mezcla única.",
      "camison-title": "Candelaria",
      "camison-desc": "Candelaria, famosa por su imponente basílica dedicada a la Virgen de Candelaria, patrona de las Islas Canarias, es un lugar de peregrinación esencial. Realmente está en el corazón de la ciudad y su cultura. Esta basílica frente al mar está adornada con estatuas monumentales que representan a los reyes guanches. También disfrutamos especialmente del paseo junto al mar, con sus estatuas y playa de arena negra.",
      "guios-title": "Vilaflor",
      "guios-desc": "Vilaflor, en las colinas de Tenerife, ofrece un magnífico entorno natural. Rodeado de bosques de pinos, es el punto de partida ideal para numerosas caminatas en el Parque Nacional del Teide. Nos encantó el ambiente tranquilo de sus calles estrechas. La iglesia de San Pedro del siglo XVII es el corazón histórico del pueblo. Y los amantes del vino apreciarán los viñedos circundantes.",
      "gaviotas-title": "Garachico",
      "gaviotas-desc": "Garachico, la antigua capital de Tenerife, es un pueblo que nos conquistó con su encanto histórico y su entorno natural. Fue reconstruido después de una erupción volcánica en el siglo XVIII. Nos encantó la combinación de los pocos edificios históricos con la vista de los acantilados y formaciones de lava. Junto al mar, esto crea piscinas naturales.",
      "benijo-title": "Santa Cruz de Tenerife",
      "benijo-desc": "Santa Cruz de Tenerife, la capital de la isla, es una ciudad dinámica que ofrece una mezcla de modernidad y tradición. De un barrio a otro, la experiencia varía mucho. Disfrutamos especialmente del Auditorio de Tenerife, diseñado por Santiago Calatrava. Esta obra maestra arquitectónica domina el paseo marítimo.",
      "bodegas-title": "Icod de los Vinos",
      "bodegas-desc": "Icod de los Vinos es famoso por su drago milenario. Pero también es una ciudad dinámica con otras atracciones turísticas, pero llena de lugareños. El corazón histórico del pueblo tiene edificios coloniales bien conservados, y el parque alrededor del Drago Milenario ofrece un interludio encantador.",
      "cueva-title": "Buenavista",
      "cueva-desc": "Buenavista es un pequeño pueblo tranquilo con casas coloridas y una bonita iglesia. Sobre todo, es la puerta de entrada a la zona volcánica de Punta de Teno al pie de los gigantescos acantilados. La combinación de paisajes es magnífica.",
      "tejita-title": "Carnaval de Tenerife",
      "tejita-desc": "El Carnaval de Tenerife tiene tres eventos que realmente no te debes perder: la gala para elegir a la Reina del Carnaval, donde las concursantes compiten en glamour y trajes imaginativos para lograr un lugar de honor; la Cabalgata, en la que la gente participa con sus mejores disfraces; y el Coso, el gran desfile frente al mar, con reinas del carnaval y sus damas de honor, carrozas y grupos musicales. Un clímax espectacular, y no te lo pierdas si quieres pasar un gran momento."
    }
  },
  "restaurants": {
    "en": {
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "selected-language": "Language ▾",
      "header-subtitle": "Discover Tenerifa Island",
      "header-title": "Top Restaurants in Tenerife",
      "filter-all": "Show All",
      "filter-yes": "with vegetarian dishes",
      "filter-no": "without vegetarian dishes",
      "sortButton": "Sort Restaurants Alphabetically",
      "medano-title": "Seen By Olivier Tenerife",
      "medano-desc": "Positive vibes and delightful surprises are ready to be discovered at SEEN Beach Club by Olivier Tenerife - the place to be by the sea. Throughout the day, you can savour a leisurely swim and, in the evening, have fun in a lively atmosphere. With a menu designed for sharing delights with friends or enjoying the best fish and meat on the island.",
      "moderate": "Menu :",
      "length": "Seafood",
      "elevation": "Mediterranean",
      "teresitas-title": "Brunelli's Steakhouse",
      "teresitas-desc": "The best steakhouse on this side of the Atlantic, with the most amazing views of the ocean. Our meats, are crispy on the outside and tender on the inside, cooked at 800ºC in our Southbend Grill, unique in the Canary Islands. A splendid steakhouse located close to the entrance to the Loro Parque zoo.",
      "moderate1": "Menu",
      "length1": "American",
      "elevation1": "Steakhouse",
      "duque-title": "El Guanche",
      "duque-desc": "Family Restaurant, since 1971. Traditional Canarian cuisine Vegetarian fusion. 90% Vegetarian. More than a lunch we offer you a culinary experience as you have never lived, in a unique place that offers the Masca Valley. Lovely Restaurant and fantastic homemade food.",
      "hard": "Menu",
      "length2": "Spanish Cuisines",
      "elevation2": "Vegetarian friendly",
      "jimenez-title": "La Torre Del Mirador",
      "jimenez-desc": "La Torre Del Mirador garners praise for its scenic location and breathtaking views, creating a fine dining atmosphere that many guests find justifies the premium prices. While the restaurant's ambiance, enhanced by live music and elegant decor, is frequently celebrated, the food quality receives mixed reviews—some visitors relish the fresh seafood, yet others question the value due to inconsistent preparation.",
      "hard3": "Menu",
      "length3": "Seafood",
      "elevation3": "Vegetarian friendly",
      "camison-title": "Sal Fina",
      "camison-desc": "Sal Fina restaurant has won the hearts of many diners with its eclectic menu that garners praise for burgers and Italian cuisine, though a few have noted a scarcity of Italian options and occasional lapses in dish preparation. Guests have called out the amiable and careful staff, suggesting reservations to navigate its popularity and at times, lengthy service.",
      "moderate4": "Menu",
      "length4": "Italian, Mediterranean",
      "elevation4": "Vegetarian friendly",
      "guios-title": "Trattoría By Royal Hideaway",
      "guios-desc": "Trattoria is a word that comes from \"trattore\", which means to prepare. At the new Trattoria by Il Bocconcino, we prepare our dishes the way Italian mammas cooked them; Homemade pastas and sauces, antipasti, foccacias and delicious pizzas baked by our master pizza maker in a wood-fired oven. All this in a relaxed and informal atmosphere ideal for sharing and enjoying with the family.",
      "hard5": "Menu",
      "length5": "Italian Cusines",
      "elevation5": "Vegetarian friendly",
      "gaviotas-title": "Ibéricos Gastro Bar",
      "gaviotas-desc": "Iberian specialties, as well as different food options, a variety of wines, delicious cocktails, among other drinks, a good atmosphere and excellent service. Ibéricos Gastro Bar emerges as a beloved spot for its exceptional balance of value and quality, with many patrons recommending reservations to secure a taste of their generous, well-spiced dishes like the acclaimed Iberian pork and ham risotto.",
      "hard6": "Menu",
      "length6": "Mediterranean",
      "elevation6": "Vegetarian friendly",
      "benijo-title": "The Bank Steak House",
      "benijo-desc": "The Bank, the restaurant that offers you a unique dining experience the Hotel Villa Cortes, located in Playa de las Americas! Prepare to delight your palate with our unique contemporary approach to an East Coast-inspired steakhouse. While some reviewers mention the steep prices, many agree that the attentive service and flavorful, perfectly prepared steaks justify the cost.",
      "hard7": "Menu",
      "length7": "American",
      "elevation7": "Steakhouse",
      "bodegas-title": "El Rinconcito De Hilario",
      "bodegas-desc": "I have been to this restaurant and I came out fully satisfied! Everything was really very good, from the first to the second, to the desserts. Portions are plentiful, so you come out full and happy. The staff is friendly and attentive, and the welcoming atmosphere makes the experience even more enjoyable. Definitely a place to come back!",
      "hard8": "Menu",
      "length8": "Seafood",
      "elevation8": "Vegetarian friendly",
      "cueva-title": "Guannabí",
      "cueva-desc": "Guannabí is a restaurant located in the old town of Santa Cruz de Tenerife, in an old and typical Canarian house that has been completely renovated achieving a modern and cosmopolitan design, but respecting and maintaining the charm of the rustic and old. It is a place that welcomes you with just entering and added to a menu prepared with great care thus achieving a fusion between Mediterranean cuisine with nuances of Mexican, Peruvian and Asian cuisine.",
      "moderate9": "Menu",
      "length9": "Mediterranean",
      "elevation9": "Vegetarian friendly",
      "tejita-title": "El Gomero",
      "tejita-desc": "Fantastic little restaurant where the locals go, including cops and cab drivers! Its between los christianos and playa de las americas. Lovely local Spanish food. Great variety on the menu and food was so tasty. Waiters was so nice and friendly. Very good variety and quality of products, fast service and all the welcoming and friendly staff.",
      "moderate10": "Menu",
      "length10": "Mediterranean",
      "elevation10": "Vegetarian friendly",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
    },
    "de": {
      "logo": "YourTrip",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Themenwechsel",
      "selected-language": "Sprache ▾",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Die besten Restaurants auf Teneriffa",
      "filter-all": "Alle anzeigen",
      "filter-yes": "mit vegetarischen Gerichten",
      "filter-no": "ohne vegetarische Gerichte",
      "sortButton": "Restaurants alphabetisch sortieren",
      "medano-title": "Seen By Olivier Tenerife",
      "medano-desc": "Positive Vibes und köstliche Überraschungen erwarten Sie im SEEN Beach Club by Olivier Tenerife - dem Ort am Meer. Tagsüber können Sie gemütlich schwimmen und abends in lebhafter Atmosphäre Spaß haben. Mit einer Speisekarte, die zum Teilen von Köstlichkeiten mit Freunden oder zum Genießen des besten Fischs und Fleischs der Insel einlädt.",
      "moderate": "Speisekarte :",
      "length": "Meeresfrüchte",
      "elevation": "Mittelmeerküche",
      "teresitas-title": "Brunelli's Steakhouse",
      "teresitas-desc": "Das beste Steakhaus auf dieser Seite des Atlantiks mit dem atemberaubendsten Blick auf den Ozean. Unsere Fleischgerichte sind außen knusprig und innen zart, zubereitet bei 800°C in unserem Southbend Grill, einzigartig auf den Kanarischen Inseln. Ein prächtiges Steakhaus in der Nähe des Eingangs zum Loro Parque Zoo.",
      "moderate1": "Speisekarte",
      "length1": "Amerikanisch",
      "elevation1": "Steakhouse",
      "duque-title": "El Guanche",
      "duque-desc": "Familienrestaurant seit 1971. Traditionelle kanarische Küche mit vegetarischer Fusion. 90% vegetarisch. Mehr als nur ein Mittagessen bieten wir Ihnen ein kulinarisches Erlebnis, wie Sie es noch nie erlebt haben, an einem einzigartigen Ort im Masca-Tal. Liebevolles Restaurant und fantastisches hausgemachtes Essen.",
      "hard": "Speisekarte",
      "length2": "Spanische Küche",
      "elevation2": "Vegetarisch freundlich",
      "jimenez-title": "La Torre Del Mirador",
      "jimenez-desc": "La Torre Del Mirador erntet Lob für seine malerische Lage und atemberaubende Aussicht, die eine gehobene Atmosphäre schafft, die viele Gäste als den höheren Preis wert empfinden. Während die Atmosphäre des Restaurants, die durch Live-Musik und elegante Dekoration bereichert wird, häufig gelobt wird, erhält die Essensqualität gemischte Bewertungen - einige Besucher genießen die frischen Meeresfrüchte, während andere den Wert aufgrund von ungleichmäßiger Zubereitung in Frage stellen.",
      "hard3": "Speisekarte",
      "length3": "Meeresfrüchte",
      "elevation3": "Vegetarisch freundlich",
      "camison-title": "Sal Fina",
      "camison-desc": "Das Restaurant Sal Fina hat mit seiner vielseitigen Speisekarte die Herzen vieler Gäste erobert, die Burger und italienische Küche loben, obwohl einige eine Knappheit an italienischen Optionen und gelegentliche Mängel bei der Zubereitung der Gerichte festgestellt haben. Gäste haben das freundliche und aufmerksame Personal hervorgehoben und empfehlen Reservierungen, um der Beliebtheit und manchmal langen Wartezeiten zu begegnen.",
      "moderate4": "Speisekarte",
      "length4": "Italienisch, Mittelmeerküche",
      "elevation4": "Vegetarisch freundlich",
      "guios-title": "Trattoría By Royal Hideaway",
      "guios-desc": "Trattoria ist ein Wort, das von \"trattore\" kommt, was \"zubereiten\" bedeutet. In der neuen Trattoria by Il Bocconcino bereiten wir unsere Gerichte so zu, wie italienische Mütter sie gekocht haben; hausgemachte Pasta und Saucen, Antipasti, Foccacias und köstliche Pizzen, die von unserem Pizzameister in einem Holzofen gebacken werden. All dies in einer entspannten und informellen Atmosphäre, die ideal ist, um sie mit der Familie zu teilen und zu genießen.",
      "hard5": "Speisekarte",
      "length5": "Italienische Küche",
      "elevation5": "Vegetarisch freundlich",
      "gaviotas-title": "Ibéricos Gastro Bar",
      "gaviotas-desc": "Iberische Spezialitäten sowie verschiedene Speisen, eine Auswahl an Weinen, köstlichen Cocktails und anderen Getränken, eine gute Atmosphäre und ausgezeichneter Service. Die Ibéricos Gastro Bar ist ein beliebter Ort für ihr außergewöhnliches Preis-Leistungs-Verhältnis, wobei viele Gäste Reservierungen empfehlen, um ihre großzügigen, gut gewürzten Gerichte wie das gefeierte iberische Schweine- und Schinkenrisotto zu probieren.",
      "hard6": "Speisekarte",
      "length6": "Mittelmeerküche",
      "elevation6": "Vegetarisch freundlich",
      "benijo-title": "The Bank Steak House",
      "benijo-desc": "The Bank, das Restaurant, das Ihnen ein einzigartiges kulinarisches Erlebnis im Hotel Villa Cortes in Playa de las Americas bietet! Bereiten Sie sich darauf vor, Ihren Gaumen mit unserem einzigartigen zeitgenössischen Ansatz eines von der Ostküste inspirierten Steakhauses zu verwöhnen. Während einige Rezensenten die hohen Preise erwähnen, sind sich viele einig, dass der aufmerksame Service und die geschmackvollen, perfekt zubereiteten Steaks den Preis rechtfertigen.",
      "hard7": "Speisekarte",
      "length7": "Amerikanisch",
      "elevation7": "Steakhouse",
      "bodegas-title": "El Rinconcito De Hilario",
      "bodegas-desc": "Ich war in diesem Restaurant und kam vollkommen zufrieden heraus! Alles war wirklich sehr gut, von der Vorspeise über die Hauptspeise bis hin zum Dessert. Die Portionen sind reichlich, so dass man satt und glücklich herauskommt. Das Personal ist freundlich und aufmerksam, und die einladende Atmosphäre macht das Erlebnis noch angenehmer. Auf jeden Fall ein Ort, an den man zurückkehren sollte!",
      "hard8": "Speisekarte",
      "length8": "Meeresfrüchte",
      "elevation8": "Vegetarisch freundlich",
      "cueva-title": "Guannabí",
      "cueva-desc": "Guannabí ist ein Restaurant in der Altstadt von Santa Cruz de Tenerife, in einem alten und typischen kanarischen Haus, das komplett renoviert wurde und ein modernes und kosmopolitisches Design aufweist, aber den Charme des Rustikalen und Alten bewahrt. Es ist ein Ort, der Sie schon beim Betreten willkommen heißt und mit einer mit großer Sorgfalt zubereiteten Speisekarte eine Fusion zwischen mediterraner Küche mit Nuancen der mexikanischen, peruanischen und asiatischen Küche bietet.",
      "moderate9": "Speisekarte",
      "length9": "Mittelmeerküche",
      "elevation9": "Vegetarisch freundlich",
      "tejita-title": "El Gomero",
      "tejita-desc": "Fantastisches kleines Restaurant, in das die Einheimischen gehen, einschließlich Polizisten und Taxifahrer! Es liegt zwischen Los Cristianos und Playa de las Americas. Liebevolle lokale spanische Küche. Große Auswahl auf der Speisekarte und das Essen war so lecker. Die Kellner waren so nett und freundlich. Sehr gute Auswahl und Qualität der Produkte, schneller Service und alles sehr einladend und freundlich.",
      "moderate10": "Speisekarte",
      "length10": "Mittelmeerküche",
      "elevation10": "Vegetarisch freundlich",
      "footer-info-title": "Teneriffa erkunden",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte auf Teneriffa zu entdecken - Strände, Wanderungen, Restaurants und versteckte Juwelen - alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
    },
    "es": {
      "logo": "YourTrip",
      "home-link": "Inicio",
      "about-link": "Acerca de",
      "faq-link": "Cambiar tema",
      "selected-language": "Idioma ▾",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Los mejores restaurantes de Tenerife",
      "filter-all": "Mostrar todos",
      "filter-yes": "con platos vegetarianos",
      "filter-no": "sin platos vegetarianos",
      "sortButton": "Ordenar restaurantes alfabéticamente",
      "medano-title": "Seen By Olivier Tenerife",
      "medano-desc": "Vibraciones positivas y deliciosas sorpresas están listas para ser descubiertas en SEEN Beach Club by Olivier Tenerife - el lugar para estar junto al mar. Durante el día, puedes disfrutar de un relajado baño y, por la noche, divertirte en un ambiente animado. Con un menú diseñado para compartir delicias con amigos o disfrutar del mejor pescado y carne de la isla.",
      "moderate": "Menú :",
      "length": "Mariscos",
      "elevation": "Mediterráneo",
      "teresitas-title": "Brunelli's Steakhouse",
      "teresitas-desc": "El mejor steakhouse de este lado del Atlántico, con las vistas más impresionantes del océano. Nuestras carnes, crujientes por fuera y tiernas por dentro, se cocinan a 800ºC en nuestra parrilla Southbend, única en las Islas Canarias. Un espléndido steakhouse ubicado cerca de la entrada al zoológico Loro Parque.",
      "moderate1": "Menú",
      "length1": "Americano",
      "elevation1": "Steakhouse",
      "duque-title": "El Guanche",
      "duque-desc": "Restaurante familiar, desde 1971. Cocina canaria tradicional con fusión vegetariana. 90% vegetariano. Más que un almuerzo, te ofrecemos una experiencia culinaria como nunca antes, en un lugar único que ofrece el Valle de Masca. Encantador restaurante y fantástica comida casera.",
      "hard": "Menú",
      "length2": "Cocina española",
      "elevation2": "Opciones vegetarianas",
      "jimenez-title": "La Torre Del Mirador",
      "jimenez-desc": "La Torre Del Mirador recibe elogios por su ubicación escénica y vistas impresionantes, creando un ambiente de alta cocina que muchos huéspedes consideran que justifica los precios premium. Mientras que el ambiente del restaurante, mejorado con música en vivo y decoración elegante, se celebra con frecuencia, la calidad de la comida recibe críticas mixtas: algunos visitantes disfrutan de los mariscos frescos, mientras que otros cuestionan el valor debido a una preparación inconsistente.",
      "hard3": "Menú",
      "length3": "Mariscos",
      "elevation3": "Opciones vegetarianas",
      "camison-title": "Sal Fina",
      "camison-desc": "El restaurante Sal Fina ha ganado el corazón de muchos comensales con su menú ecléctico que recibe elogios por sus hamburguesas y cocina italiana, aunque algunos han notado una escasez de opciones italianas y lapsos ocasionales en la preparación de los platos. Los clientes han destacado el personal amable y cuidadoso, sugiriendo reservas para navegar su popularidad y, a veces, el servicio prolongado.",
      "moderate4": "Menú",
      "length4": "Italiana, Mediterránea",
      "elevation4": "Opciones vegetarianas",
      "guios-title": "Trattoría By Royal Hideaway",
      "guios-desc": "Trattoria es una palabra que viene de \"trattore\", que significa preparar. En la nueva Trattoria by Il Bocconcino, preparamos nuestros platos como lo hacían las mamás italianas; pastas y salsas caseras, antipasti, foccacias y deliciosas pizzas horneadas por nuestro maestro pizzero en un horno de leña. Todo esto en un ambiente relajado e informal ideal para compartir y disfrutar en familia.",
      "hard5": "Menú",
      "length5": "Cocina italiana",
      "elevation5": "Opciones vegetarianas",
      "gaviotas-title": "Ibéricos Gastro Bar",
      "gaviotas-desc": "Especialidades ibéricas, así como diferentes opciones de comida, una variedad de vinos, deliciosos cócteles, entre otras bebidas, un buen ambiente y un excelente servicio. Ibéricos Gastro Bar surge como un lugar querido por su excepcional equilibrio entre valor y calidad, con muchos clientes recomendando reservas para asegurar un gusto de sus generosos y bien condimentados platos como el aclamado risotto de cerdo ibérico y jamón.",
      "hard6": "Menú",
      "length6": "Mediterránea",
      "elevation6": "Opciones vegetarianas",
      "benijo-title": "The Bank Steak House",
      "benijo-desc": "The Bank, el restaurante que te ofrece una experiencia gastronómica única en el Hotel Villa Cortes, ubicado en Playa de las Américas! Prepárate para deleitar tu paladar con nuestro enfoque contemporáneo único inspirado en los steakhouses de la Costa Este. Mientras algunos críticos mencionan los altos precios, muchos están de acuerdo en que el servicio atento y los sabrosos y perfectamente preparados filetes justifican el costo.",
      "hard7": "Menú",
      "length7": "Americano",
      "elevation7": "Steakhouse",
      "bodegas-title": "El Rinconcito De Hilario",
      "bodegas-desc": "¡He estado en este restaurante y salí completamente satisfecho! Todo estuvo realmente muy bien, desde el primer plato hasta el segundo y los postres. Las porciones son abundantes, así que sales lleno y feliz. El personal es amable y atento, y el ambiente acogedor hace que la experiencia sea aún más agradable. ¡Definitivamente un lugar para volver!",
      "hard8": "Menú",
      "length8": "Mariscos",
      "elevation8": "Opciones vegetarianas",
      "cueva-title": "Guannabí",
      "cueva-desc": "Guannabí es un restaurante ubicado en el casco antiguo de Santa Cruz de Tenerife, en una antigua y típica casa canaria que ha sido completamente renovada logrando un diseño moderno y cosmopolita, pero respetando y manteniendo el encanto de lo rústico y antiguo. Es un lugar que te recibe con solo entrar y se suma a un menú preparado con mucho cuidado logrando así una fusión entre la cocina mediterránea con matices de la cocina mexicana, peruana y asiática.",
      "moderate9": "Menú",
      "length9": "Mediterránea",
      "elevation9": "Opciones vegetarianas",
      "tejita-title": "El Gomero",
      "tejita-desc": "¡Fantástico pequeño restaurante al que van los locales, incluidos policías y taxistas! Está entre Los Cristianos y Playa de las Américas. Encantadora comida local española. Gran variedad en el menú y la comida estaba muy sabrosa. Los camareros eran muy amables y simpáticos. Muy buena variedad y calidad de los productos, servicio rápido y todo el personal muy acogedor y amable.",
      "moderate10": "Menú",
      "length10": "Mediterránea",
      "elevation10": "Opciones vegetarianas",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife: playas, senderos, restaurantes y joyas ocultas, todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin florituras.",
      "footer-contact-title": "Contacto",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
    }
  },
  "wiewpoints": {
    "en": {
      "logo": "YourTrip",
      "home-link": "Home",
      "about-link": "About",
      "faq-link": "Theme Switch",
      "selected-language": "Language ▾",
      "header-subtitle": "Discover Tenerife Island",
      "header-title": "Top Viewpoints to Visit",
      "medano-title": "Las Narices del Teide",
      "medano-desc": "The Mirador de las Narices del Teide is a lesser-known vantage point in Tenerife, offering spectacular views of the last eruption of Teide almost 225 years ago. Ideal for enjoying magical sunsets over the sea of clouds, this tranquil viewpoint is accessible mainly by car, promising a serene experience away from the crowds, perfect for nature and photography lovers.",
      "teresitas-title": "Pico del Inglés",
      "teresitas-desc": "The Mirador Pico del Inglés, located in the north of Tenerife, offers spectacular views stretching from Mount Teide to the vast ocean, this viewpoint combines the majesty of nature with urban panoramas, promising an unforgettable visual and sensory experience. Accessible by car, it is the perfect place for a peaceful and serene escape, where the beauty of Tenerife is revealed in all its splendour.",
      "duque-title": "Chipeque",
      "duque-desc": "The Mirador de Chipeque is a must-see destination in northern Tenerife, offering spectacular views of Mount Teide and a magical sea of clouds at sunset. A natural phenomenon that adds a mystical touch to the landscape. Although parking is limited, the experience of connecting with nature and capturing unforgettable landscapes is well worth the early visit and warm clothing.",
      "jimenez-title": "Ortuño",
      "jimenez-desc": "The Mirador de Ortuño in Tenerife offers spectacular views of Teide and the natural recovery after fires. Located in the Teide National Park, it provides convenient access to panoramas of the volcano and sea of clouds, framed by resilient Canary Island pines. Ideal for contemplating nature and learning about the local geology through information panels.",
      "camison-title": "Archipenque",
      "camison-desc": "Located in Los Gigantes, this is a must-visit destination offering panoramic views of the Los Gigantes Cliffs and, on clear days, the islands of La Gomera and La Palma. Easily accessible by road, it has limited parking and a cosy bar to enjoy the scene. Ideal for capturing spectacular sunsets.",
      "guios-title": "Cruz del Carmen",
      "guios-desc": "The Cruz del Carmen viewpoint, located in La Laguna, offers a unique experience in the Anaga Rural Park, with changing views ranging from dense fog to clear panoramic views of Teide on clear days. Despite parking difficulties, its trails adapted to all levels and the visitor centre make this place a must for nature lovers and hikers in Tenerife.",
      "gaviotas-title": "La Ruleta",
      "gaviotas-desc": "The Mirador de La Ruleta, located in the Teide National Park in Tenerife, offers spectacular views of Teide, Roques de García, and Llano de Ucanca, capturing the volcanic essence of the island. This observation point is ideal for peaceful sunrises, photography and connecting with nature. With easy access and parking space, it is a transformative experience and a reminder of the natural majesty of the Canary Islands.",
      "benijo-title": "Cherfe",
      "benijo-desc": "The Mirador de Cherfe in Tenerife offers breathtaking views of the western face of Mount Teide, the Masca Valley and the neighbouring islands from a narrow, winding road. It is a spectacular destination for nature and photography lovers, where the majesty of the landscape invites contemplation and enjoyment of the island's natural beauty.",
      "bodegas-title": "Jardina",
      "bodegas-desc": "The Mirador de Jardina in Tenerife offers spectacular views of La Laguna, Teide and the Anaga Massif, making it an ideal starting point for exploring the Anaga Rural Park. Limited to a small car park, this place invites for a short but intense visit, enriched by the warmth of the local people. It is especially magical at sunset, when the sky and the Teide offer an unforgettable spectacle of colours.",
      "cueva-title": "Altos de Baracán",
      "cueva-desc": "Mirador Altos de Baracán in Tenerife is a spectacular hideaway offering panoramic views of Teide and the vast ocean, accessible via narrow, winding roads that promise a thrilling adventure. Limited in parking space, this place preserves its serenity and beauty, inviting deep contemplation and awe at the majesty of nature.",
      "tejita-title": "Montaña Roja",
      "tejita-desc": "The Mirador Montaña Roja in El Médano, Tenerife, offers a unique experience of connecting with nature through its impressive volcanic landscape. The climb, which takes about 20 to 30 minutes, rewards you with spectacular 360-degree views of the ocean and pristine beaches. This protected area, rich in biodiversity, is ideal for hikers, photographers and seekers of tranquillity. It is essential to bring appropriate footwear, sun protection and water.",
      "footer-info-title": "Explore Tenerife",
      "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
      "footer-contact-title": "Contact",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
    },
    "de": {
      "logo": "YourTrip",
      "home-link": "Startseite",
      "about-link": "Über uns",
      "faq-link": "Themenwechsel",
      "selected-language": "Sprache ▾",
      "header-subtitle": "Entdecken Sie die Insel Teneriffa",
      "header-title": "Die besten Aussichtspunkte",
      "medano-title": "Las Narices del Teide",
      "medano-desc": "Der Mirador de las Narices del Teide ist ein weniger bekannter Aussichtspunkt auf Teneriffa, der einen spektakulären Blick auf den letzten Ausbruch des Teide vor fast 225 Jahren bietet. Ideal, um magische Sonnenuntergänge über dem Wolkenmeer zu genießen, ist dieser ruhige Aussichtspunkt hauptsächlich mit dem Auto erreichbar und verspricht ein friedliches Erlebnis abseits der Menschenmassen, perfekt für Natur- und Fotoliebhaber.",
      "teresitas-title": "Pico del Inglés",
      "teresitas-desc": "Der Mirador Pico del Inglés im Norden Teneriffas bietet spektakuläre Aussichten, die sich vom Teide bis zum weiten Ozean erstrecken. Dieser Aussichtspunkt vereint die Majestät der Natur mit urbanen Panoramen und verspricht ein unvergessliches visuelles und sinnliches Erlebnis. Mit dem Auto erreichbar, ist er der perfekte Ort für einen friedlichen und ruhigen Rückzug, wo die Schönheit Teneriffas in voller Pracht enthüllt wird.",
      "duque-title": "Chipeque",
      "duque-desc": "Der Mirador de Chipeque ist ein Muss im Norden Teneriffas und bietet spektakuläre Aussichten auf den Teide und ein magisches Wolkenmeer bei Sonnenuntergang. Ein natürliches Phänomen, das der Landschaft einen mystischen Touch verleiht. Obwohl die Parkplätze begrenzt sind, lohnt sich der frühe Besuch und warme Kleidung für die Erfahrung, mit der Natur in Verbindung zu treten und unvergessliche Landschaften einzufangen.",
      "jimenez-title": "Ortuño",
      "jimenez-desc": "Der Mirador de Ortuño auf Teneriffa bietet spektakuläre Aussichten auf den Teide und die natürliche Regeneration nach Bränden. Im Teide-Nationalpark gelegen, bietet er einen bequemen Zugang zu Panoramen des Vulkans und des Wolkenmeeres, eingerahmt von widerstandsfähigen Kanarenkiefern. Ideal, um die Natur zu betrachten und mehr über die lokale Geologie durch Informationstafeln zu lernen.",
      "camison-title": "Archipenque",
      "camison-desc": "In Los Gigantes gelegen, ist dies ein Muss für Besucher, die Panoramablicke auf die Klippen von Los Gigantes und an klaren Tagen auf die Inseln La Gomera und La Palma genießen möchten. Leicht mit dem Auto erreichbar, bietet er begrenzte Parkplätze und eine gemütliche Bar, um die Szenerie zu genießen. Ideal, um spektakuläre Sonnenuntergänge einzufangen.",
      "guios-title": "Cruz del Carmen",
      "guios-desc": "Der Aussichtspunkt Cruz del Carmen in La Laguna bietet ein einzigartiges Erlebnis im Anaga-Landschaftspark mit wechselnden Aussichten, die von dichtem Nebel bis zu klaren Panoramablicken auf den Teide an klaren Tagen reichen. Trotz Parkplatzschwierigkeiten machen die für alle Levels geeigneten Wanderwege und das Besucherzentrum diesen Ort zu einem Muss für Naturliebhaber und Wanderer auf Teneriffa.",
      "gaviotas-title": "La Ruleta",
      "gaviotas-desc": "Der Mirador de La Ruleta im Teide-Nationalpark auf Teneriffa bietet spektakuläre Aussichten auf den Teide, die Roques de García und das Llano de Ucanca und fängt die vulkanische Essenz der Insel ein. Dieser Beobachtungspunkt ist ideal für friedliche Sonnenaufgänge, Fotografie und die Verbindung mit der Natur. Mit leichtem Zugang und Parkmöglichkeiten ist es eine transformative Erfahrung und eine Erinnerung an die natürliche Majestät der Kanarischen Inseln.",
      "benijo-title": "Cherfe",
      "benijo-desc": "Der Mirador de Cherfe auf Teneriffa bietet atemberaubende Aussichten auf die Westseite des Teide, das Masca-Tal und die Nachbarinseln von einer schmalen, kurvenreichen Straße aus. Es ist ein spektakuläres Ziel für Natur- und Fotoliebhaber, wo die Majestät der Landschaft zur Kontemplation und zum Genuss der natürlichen Schönheit der Insel einlädt.",
      "bodegas-title": "Jardina",
      "bodegas-desc": "Der Mirador de Jardina auf Teneriffa bietet spektakuläre Aussichten auf La Laguna, den Teide und das Anaga-Massiv und ist somit ein idealer Ausgangspunkt für die Erkundung des Anaga-Landschaftsparks. Begrenzt auf einen kleinen Parkplatz, lädt dieser Ort zu einem kurzen aber intensiven Besuch ein, bereichert durch die Wärme der Einheimischen. Besonders magisch ist es bei Sonnenuntergang, wenn der Himmel und der Teide ein unvergessliches Farbenspektakel bieten.",
      "cueva-title": "Altos de Baracán",
      "cueva-desc": "Der Mirador Altos de Baracán auf Teneriffa ist ein spektakulärer Rückzugsort mit Panoramablick auf den Teide und den weiten Ozean, erreichbar über schmale, kurvenreiche Straßen, die ein aufregendes Abenteuer versprechen. Mit begrenztem Parkplatz bewahrt dieser Ort seine Ruhe und Schönheit und lädt zu tiefer Kontemplation und Staunen über die Majestät der Natur ein.",
      "tejita-title": "Montaña Roja",
      "tejita-desc": "Der Mirador Montaña Roja in El Médano auf Teneriffa bietet eine einzigartige Erfahrung der Verbindung mit der Natur durch seine beeindruckende Vulkanlandschaft. Der Aufstieg, der etwa 20 bis 30 Minuten dauert, belohnt Sie mit spektakulären 360-Grad-Blicken auf den Ozean und unberührte Strände. Dieses geschützte Gebiet, reich an Biodiversität, ist ideal für Wanderer, Fotografen und Ruhesuchende. Es ist wichtig, geeignetes Schuhwerk, Sonnenschutz und Wasser mitzubringen.",
      "footer-info-title": "Teneriffa entdecken",
      "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
      "footer-contact-title": "Kontakt",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
    },
    "es": {
      "logo": "YourTrip",
      "home-link": "Inicio",
      "about-link": "Sobre nosotros",
      "faq-link": "Cambiar tema",
      "selected-language": "Idioma ▾",
      "header-subtitle": "Descubre la isla de Tenerife",
      "header-title": "Los mejores miradores para visitar",
      "medano-title": "Las Narices del Teide",
      "medano-desc": "El Mirador de las Narices del Teide es un punto de vista menos conocido en Tenerife, que ofrece espectaculares vistas de la última erupción del Teide hace casi 225 años. Ideal para disfrutar de puestas de sol mágicas sobre el mar de nubes, este tranquilo mirador es accesible principalmente en coche, prometiendo una experiencia serena lejos de las multitudes, perfecta para los amantes de la naturaleza y la fotografía.",
      "teresitas-title": "Pico del Inglés",
      "teresitas-desc": "El Mirador Pico del Inglés, ubicado en el norte de Tenerife, ofrece vistas espectaculares que se extienden desde el Teide hasta el vasto océano, este mirador combina la majestuosidad de la naturaleza con panorámicas urbanas, prometiendo una experiencia visual y sensorial inolvidable. Accesible en coche, es el lugar perfecto para un escape pacífico y sereno, donde la belleza de Tenerife se revela en todo su esplendor.",
      "duque-title": "Chipeque",
      "duque-desc": "El Mirador de Chipeque es un destino imprescindible en el norte de Tenerife, que ofrece vistas espectaculares del Teide y un mar de nubes mágico al atardecer. Un fenómeno natural que añade un toque místico al paisaje. Aunque el aparcamiento es limitado, la experiencia de conectar con la naturaleza y capturar paisajes inolvidables vale la pena la visita temprana y la ropa abrigada.",
      "jimenez-title": "Ortuño",
      "jimenez-desc": "El Mirador de Ortuño en Tenerife ofrece vistas espectaculares del Teide y la recuperación natural después de los incendios. Ubicado en el Parque Nacional del Teide, proporciona un acceso conveniente a panoramas del volcán y el mar de nubes, enmarcados por resistentes pinos canarios. Ideal para contemplar la naturaleza y aprender sobre la geología local a través de paneles informativos.",
      "camison-title": "Archipenque",
      "camison-desc": "Ubicado en Los Gigantes, este es un destino obligado que ofrece vistas panorámicas de los Acantilados de Los Gigantes y, en días claros, de las islas de La Gomera y La Palma. Fácilmente accesible por carretera, tiene aparcamiento limitado y un acogedor bar para disfrutar del paisaje. Ideal para capturar puestas de sol espectaculares.",
      "guios-title": "Cruz del Carmen",
      "guios-desc": "El mirador de Cruz del Carmen, ubicado en La Laguna, ofrece una experiencia única en el Parque Rural de Anaga, con vistas cambiantes que van desde la densa niebla hasta panorámicas claras del Teide en días despejados. A pesar de las dificultades de aparcamiento, sus senderos adaptados a todos los niveles y el centro de visitantes hacen de este lugar un imprescindible para los amantes de la naturaleza y los senderistas en Tenerife.",
      "gaviotas-title": "La Ruleta",
      "gaviotas-desc": "El Mirador de La Ruleta, ubicado en el Parque Nacional del Teide en Tenerife, ofrece vistas espectaculares del Teide, los Roques de García y el Llano de Ucanca, capturando la esencia volcánica de la isla. Este punto de observación es ideal para amaneceres tranquilos, fotografía y conexión con la naturaleza. Con fácil acceso y espacio de aparcamiento, es una experiencia transformadora y un recordatorio de la majestuosidad natural de las Islas Canarias.",
      "benijo-title": "Cherfe",
      "benijo-desc": "El Mirador de Cherfe en Tenerife ofrece vistas impresionantes de la cara oeste del Teide, el Valle de Masca y las islas vecinas desde una carretera estrecha y sinuosa. Es un destino espectacular para los amantes de la naturaleza y la fotografía, donde la majestuosidad del paisaje invita a la contemplación y al disfrute de la belleza natural de la isla.",
      "bodegas-title": "Jardina",
      "bodegas-desc": "El Mirador de Jardina en Tenerife ofrece vistas espectaculares de La Laguna, el Teide y el Macizo de Anaga, convirtiéndolo en un punto de partida ideal para explorar el Parque Rural de Anaga. Limitado a un pequeño aparcamiento, este lugar invita a una visita corta pero intensa, enriquecida por la calidez de la gente local. Es especialmente mágico al atardecer, cuando el cielo y el Teide ofrecen un espectáculo de colores inolvidable.",
      "cueva-title": "Altos de Baracán",
      "cueva-desc": "El Mirador Altos de Baracán en Tenerife es un refugio espectacular que ofrece vistas panorámicas del Teide y el vasto océano, accesible a través de carreteras estrechas y sinuosas que prometen una aventura emocionante. Con espacio de aparcamiento limitado, este lugar preserva su serenidad y belleza, invitando a una profunda contemplación y asombro ante la majestuosidad de la naturaleza.",
      "tejita-title": "Montaña Roja",
      "tejita-desc": "El Mirador Montaña Roja en El Médano, Tenerife, ofrece una experiencia única de conexión con la naturaleza a través de su impresionante paisaje volcánico. La subida, que toma entre 20 y 30 minutos, te recompensa con vistas espectaculares de 360 grados del océano y playas prístinas. Esta área protegida, rica en biodiversidad, es ideal para excursionistas, fotógrafos y buscadores de tranquilidad. Es esencial llevar calzado adecuado, protección solar y agua.",
      "footer-info-title": "Explora Tenerife",
      "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin florituras.",
      "footer-contact-title": "Contacto",
      "footer-email": "hello@exploretenerife.com",
      "footer-instagram": "Instagram",
      "footer-facebook": "Facebook",
      "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
    }
  }
}
