{
  "en": {
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "selected-language": "Language ▾",
    "header-subtitle": "Discover Tenerife Island",
    "header-title": "Top Viewpoints to Visit",
    "medano-title": "Las Narices del Teide",
    "medano-desc": "The Mirador de las Narices del Teide is a lesser-known vantage point in Tenerife, offering spectacular views of the last eruption of Teide almost 225 years ago. Ideal for enjoying magical sunsets over the sea of clouds, this tranquil viewpoint is accessible mainly by car, promising a serene experience away from the crowds, perfect for nature and photography lovers.",
    "teresitas-title": "Pico del Inglés",
    "teresitas-desc": "The Mirador Pico del Inglés, located in the north of Tenerife, offers spectacular views stretching from Mount Teide to the vast ocean, this viewpoint combines the majesty of nature with urban panoramas, promising an unforgettable visual and sensory experience. Accessible by car, it is the perfect place for a peaceful and serene escape, where the beauty of Tenerife is revealed in all its splendour.",
    "duque-title": "Chipeque",
    "duque-desc": "The Mirador de Chipeque is a must-see destination in northern Tenerife, offering spectacular views of Mount Teide and a magical sea of clouds at sunset. A natural phenomenon that adds a mystical touch to the landscape. Although parking is limited, the experience of connecting with nature and capturing unforgettable landscapes is well worth the early visit and warm clothing.",
    "jimenez-title": "Ortuño",
    "jimenez-desc": "The Mirador de Ortuño in Tenerife offers spectacular views of Teide and the natural recovery after fires. Located in the Teide National Park, it provides convenient access to panoramas of the volcano and sea of clouds, framed by resilient Canary Island pines. Ideal for contemplating nature and learning about the local geology through information panels.",
    "camison-title": "Archipenque",
    "camison-desc": "Located in Los Gigantes, this is a must-visit destination offering panoramic views of the Los Gigantes Cliffs and, on clear days, the islands of La Gomera and La Palma. Easily accessible by road, it has limited parking and a cosy bar to enjoy the scene. Ideal for capturing spectacular sunsets.",
    "guios-title": "Cruz del Carmen",
    "guios-desc": "The Cruz del Carmen viewpoint, located in La Laguna, offers a unique experience in the Anaga Rural Park, with changing views ranging from dense fog to clear panoramic views of Teide on clear days. Despite parking difficulties, its trails adapted to all levels and the visitor centre make this place a must for nature lovers and hikers in Tenerife.",
    "gaviotas-title": "La Ruleta",
    "gaviotas-desc": "The Mirador de La Ruleta, located in the Teide National Park in Tenerife, offers spectacular views of Teide, Roques de García, and Llano de Ucanca, capturing the volcanic essence of the island. This observation point is ideal for peaceful sunrises, photography and connecting with nature. With easy access and parking space, it is a transformative experience and a reminder of the natural majesty of the Canary Islands.",
    "benijo-title": "Cherfe",
    "benijo-desc": "The Mirador de Cherfe in Tenerife offers breathtaking views of the western face of Mount Teide, the Masca Valley and the neighbouring islands from a narrow, winding road. It is a spectacular destination for nature and photography lovers, where the majesty of the landscape invites contemplation and enjoyment of the island's natural beauty.",
    "bodegas-title": "Jardina",
    "bodegas-desc": "The Mirador de Jardina in Tenerife offers spectacular views of La Laguna, Teide and the Anaga Massif, making it an ideal starting point for exploring the Anaga Rural Park. Limited to a small car park, this place invites for a short but intense visit, enriched by the warmth of the local people. It is especially magical at sunset, when the sky and the Teide offer an unforgettable spectacle of colours.",
    "cueva-title": "Altos de Baracán",
    "cueva-desc": "Mirador Altos de Baracán in Tenerife is a spectacular hideaway offering panoramic views of Teide and the vast ocean, accessible via narrow, winding roads that promise a thrilling adventure. Limited in parking space, this place preserves its serenity and beauty, inviting deep contemplation and awe at the majesty of nature.",
    "tejita-title": "Montaña Roja",
    "tejita-desc": "The Mirador Montaña Roja in El Médano, Tenerife, offers a unique experience of connecting with nature through its impressive volcanic landscape. The climb, which takes about 20 to 30 minutes, rewards you with spectacular 360-degree views of the ocean and pristine beaches. This protected area, rich in biodiversity, is ideal for hikers, photographers and seekers of tranquillity. It is essential to bring appropriate footwear, sun protection and water.",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved."
  },
  "de": {
    "logo": "YourTrip",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Themenwechsel",
    "selected-language": "Sprache ▾",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Die besten Aussichtspunkte",
    "medano-title": "Las Narices del Teide",
    "medano-desc": "Der Mirador de las Narices del Teide ist ein weniger bekannter Aussichtspunkt auf Teneriffa, der einen spektakulären Blick auf den letzten Ausbruch des Teide vor fast 225 Jahren bietet. Ideal, um magische Sonnenuntergänge über dem Wolkenmeer zu genießen, ist dieser ruhige Aussichtspunkt hauptsächlich mit dem Auto erreichbar und verspricht ein friedliches Erlebnis abseits der Menschenmassen, perfekt für Natur- und Fotoliebhaber.",
    "teresitas-title": "Pico del Inglés",
    "teresitas-desc": "Der Mirador Pico del Inglés im Norden Teneriffas bietet spektakuläre Aussichten, die sich vom Teide bis zum weiten Ozean erstrecken. Dieser Aussichtspunkt vereint die Majestät der Natur mit urbanen Panoramen und verspricht ein unvergessliches visuelles und sinnliches Erlebnis. Mit dem Auto erreichbar, ist er der perfekte Ort für einen friedlichen und ruhigen Rückzug, wo die Schönheit Teneriffas in voller Pracht enthüllt wird.",
    "duque-title": "Chipeque",
    "duque-desc": "Der Mirador de Chipeque ist ein Muss im Norden Teneriffas und bietet spektakuläre Aussichten auf den Teide und ein magisches Wolkenmeer bei Sonnenuntergang. Ein natürliches Phänomen, das der Landschaft einen mystischen Touch verleiht. Obwohl die Parkplätze begrenzt sind, lohnt sich der frühe Besuch und warme Kleidung für die Erfahrung, mit der Natur in Verbindung zu treten und unvergessliche Landschaften einzufangen.",
    "jimenez-title": "Ortuño",
    "duque-desc": "Der Mirador de Chipeque ist ein Muss im Norden Teneriffas und bietet spektakuläre Aussichten auf den Teide und ein magisches Wolkenmeer bei Sonnenuntergang. Ein natürliches Phänomen, das der Landschaft einen mystischen Touch verleiht. Obwohl die Parkplätze begrenzt sind, lohnt sich der frühe Besuch und warme Kleidung für die Erfahrung, mit der Natur in Verbindung zu treten und unvergessliche Landschaften einzufangen.",
    "jimenez-title": "Ortuño",
    "jimenez-desc": "Der Mirador de Ortuño auf Teneriffa bietet spektakuläre Aussichten auf den Teide und die natürliche Regeneration nach Bränden. Im Teide-Nationalpark gelegen, bietet er einen bequemen Zugang zu Panoramen des Vulkans und des Wolkenmeeres, eingerahmt von widerstandsfähigen Kanarenkiefern. Ideal, um die Natur zu betrachten und mehr über die lokale Geologie durch Informationstafeln zu lernen.",
    "camison-title": "Archipenque",
    "camison-desc": "In Los Gigantes gelegen, ist dies ein Muss für Besucher, die Panoramablicke auf die Klippen von Los Gigantes und an klaren Tagen auf die Inseln La Gomera und La Palma genießen möchten. Leicht mit dem Auto erreichbar, bietet er begrenzte Parkplätze und eine gemütliche Bar, um die Szenerie zu genießen. Ideal, um spektakuläre Sonnenuntergänge einzufangen.",
    "guios-title": "Cruz del Carmen",
    "guios-desc": "Der Aussichtspunkt Cruz del Carmen in La Laguna bietet ein einzigartiges Erlebnis im Anaga-Landschaftspark mit wechselnden Aussichten, die von dichtem Nebel bis zu klaren Panoramablicken auf den Teide an klaren Tagen reichen. Trotz Parkplatzschwierigkeiten machen die für alle Levels geeigneten Wanderwege und das Besucherzentrum diesen Ort zu einem Muss für Naturliebhaber und Wanderer auf Teneriffa.",
    "gaviotas-title": "La Ruleta",
    "gaviotas-desc": "Der Mirador de La Ruleta im Teide-Nationalpark auf Teneriffa bietet spektakuläre Aussichten auf den Teide, die Roques de García und das Llano de Ucanca und fängt die vulkanische Essenz der Insel ein. Dieser Beobachtungspunkt ist ideal für friedliche Sonnenaufgänge, Fotografie und die Verbindung mit der Natur. Mit leichtem Zugang und Parkmöglichkeiten ist es eine transformative Erfahrung und eine Erinnerung an die natürliche Majestät der Kanarischen Inseln.",
    "benijo-title": "Cherfe",
    "benijo-desc": "Der Mirador de Cherfe auf Teneriffa bietet atemberaubende Aussichten auf die Westseite des Teide, das Masca-Tal und die Nachbarinseln von einer schmalen, kurvenreichen Straße aus. Es ist ein spektakuläres Ziel für Natur- und Fotoliebhaber, wo die Majestät der Landschaft zur Kontemplation und zum Genuss der natürlichen Schönheit der Insel einlädt.",
    "bodegas-title": "Jardina",
    "bodegas-desc": "Der Mirador de Jardina auf Teneriffa bietet spektakuläre Aussichten auf La Laguna, den Teide und das Anaga-Massiv und ist somit ein idealer Ausgangspunkt für die Erkundung des Anaga-Landschaftsparks. Begrenzt auf einen kleinen Parkplatz, lädt dieser Ort zu einem kurzen aber intensiven Besuch ein, bereichert durch die Wärme der Einheimischen. Besonders magisch ist es bei Sonnenuntergang, wenn der Himmel und der Teide ein unvergessliches Farbenspektakel bieten.",
    "cueva-title": "Altos de Baracán",
    "cueva-desc": "Der Mirador Altos de Baracán auf Teneriffa ist ein spektakulärer Rückzugsort mit Panoramablick auf den Teide und den weiten Ozean, erreichbar über schmale, kurvenreiche Straßen, die ein aufregendes Abenteuer versprechen. Mit begrenztem Parkplatz bewahrt dieser Ort seine Ruhe und Schönheit und lädt zu tiefer Kontemplation und Staunen über die Majestät der Natur ein.",
    "tejita-title": "Montaña Roja",
    "tejita-desc": "Der Mirador Montaña Roja in El Médano auf Teneriffa bietet eine einzigartige Erfahrung der Verbindung mit der Natur durch seine beeindruckende Vulkanlandschaft. Der Aufstieg, der etwa 20 bis 30 Minuten dauert, belohnt Sie mit spektakulären 360-Grad-Blicken auf den Ozean und unberührte Strände. Dieses geschützte Gebiet, reich an Biodiversität, ist ideal für Wanderer, Fotografen und Ruhesuchende. Es ist wichtig, geeignetes Schuhwerk, Sonnenschutz und Wasser mitzubringen.",
    "footer-info-title": "Teneriffa entdecken",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Alle Rechte vorbehalten."
  },
  "es": {
    "logo": "YourTrip",
    "home-link": "Inicio",
    "about-link": "Sobre nosotros",
    "faq-link": "Cambiar tema",
    "selected-language": "Idioma ▾",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Los mejores miradores para visitar",
    "medano-title": "Las Narices del Teide",
    "medano-desc": "El Mirador de las Narices del Teide es un punto de vista menos conocido en Tenerife, que ofrece espectaculares vistas de la última erupción del Teide hace casi 225 años. Ideal para disfrutar de puestas de sol mágicas sobre el mar de nubes, este tranquilo mirador es accesible principalmente en coche, prometiendo una experiencia serena lejos de las multitudes, perfecta para los amantes de la naturaleza y la fotografía.",
    "teresitas-title": "Pico del Inglés",
    "teresitas-desc": "El Mirador Pico del Inglés, ubicado en el norte de Tenerife, ofrece vistas espectaculares que se extienden desde el Teide hasta el vasto océano, este mirador combina la majestuosidad de la naturaleza con panorámicas urbanas, prometiendo una experiencia visual y sensorial inolvidable. Accesible en coche, es el lugar perfecto para un escape pacífico y sereno, donde la belleza de Tenerife se revela en todo su esplendor.",
    "duque-title": "Chipeque",
    "duque-desc": "El Mirador de Chipeque es un destino imprescindible en el norte de Tenerife, que ofrece vistas espectaculares del Teide y un mar de nubes mágico al atardecer. Un fenómeno natural que añade un toque místico al paisaje. Aunque el aparcamiento es limitado, la experiencia de conectar con la naturaleza y capturar paisajes inolvidables vale la pena la visita temprana y la ropa abrigada.",
    "jimenez-title": "Ortuño",
    "jimenez-desc": "El Mirador de Ortuño en Tenerife ofrece vistas espectaculares del Teide y la recuperación natural después de los incendios. Ubicado en el Parque Nacional del Teide, proporciona un acceso conveniente a panoramas del volcán y el mar de nubes, enmarcados por resistentes pinos canarios. Ideal para contemplar la naturaleza y aprender sobre la geología local a través de paneles informativos.",
    "camison-title": "Archipenque",
    "camison-desc": "Ubicado en Los Gigantes, este es un destino obligado que ofrece vistas panorámicas de los Acantilados de Los Gigantes y, en días claros, de las islas de La Gomera y La Palma. Fácilmente accesible por carretera, tiene aparcamiento limitado y un acogedor bar para disfrutar del paisaje. Ideal para capturar puestas de sol espectaculares.",
    "guios-title": "Cruz del Carmen",
    "guios-desc": "El mirador de Cruz del Carmen, ubicado en La Laguna, ofrece una experiencia única en el Parque Rural de Anaga, con vistas cambiantes que van desde la densa niebla hasta panorámicas claras del Teide en días despejados. A pesar de las dificultades de aparcamiento, sus senderos adaptados a todos los niveles y el centro de visitantes hacen de este lugar un imprescindible para los amantes de la naturaleza y los senderistas en Tenerife.",
    "gaviotas-title": "La Ruleta",
    "gaviotas-desc": "El Mirador de La Ruleta, ubicado en el Parque Nacional del Teide en Tenerife, ofrece vistas espectaculares del Teide, los Roques de García y el Llano de Ucanca, capturando la esencia volcánica de la isla. Este punto de observación es ideal para amaneceres tranquilos, fotografía y conexión con la naturaleza. Con fácil acceso y espacio de aparcamiento, es una experiencia transformadora y un recordatorio de la majestuosidad natural de las Islas Canarias.",
    "benijo-title": "Cherfe",
    "benijo-desc": "El Mirador de Cherfe en Tenerife ofrece vistas impresionantes de la cara oeste del Teide, el Valle de Masca y las islas vecinas desde una carretera estrecha y sinuosa. Es un destino espectacular para los amantes de la naturaleza y la fotografía, donde la majestuosidad del paisaje invita a la contemplación y al disfrute de la belleza natural de la isla.",
    "bodegas-title": "Jardina",
    "bodegas-desc": "El Mirador de Jardina en Tenerife ofrece vistas espectaculares de La Laguna, el Teide y el Macizo de Anaga, convirtiéndolo en un punto de partida ideal para explorar el Parque Rural de Anaga. Limitado a un pequeño aparcamiento, este lugar invita a una visita corta pero intensa, enriquecida por la calidez de la gente local. Es especialmente mágico al atardecer, cuando el cielo y el Teide ofrecen un espectáculo de colores inolvidable.",
    "cueva-title": "Altos de Baracán",
    "cueva-desc": "El Mirador Altos de Baracán en Tenerife es un refugio espectacular que ofrece vistas panorámicas del Teide y el vasto océano, accesible a través de carreteras estrechas y sinuosas que prometen una aventura emocionante. Con espacio de aparcamiento limitado, este lugar preserva su serenidad y belleza, invitando a una profunda contemplación y asombro ante la majestuosidad de la naturaleza.",
    "tejita-title": "Montaña Roja",
    "tejita-desc": "El Mirador Montaña Roja en El Médano, Tenerife, ofrece una experiencia única de conexión con la naturaleza a través de su impresionante paisaje volcánico. La subida, que toma entre 20 y 30 minutos, te recompensa con vistas espectaculares de 360 grados del océano y playas prístinas. Esta área protegida, rica en biodiversidad, es ideal para excursionistas, fotógrafos y buscadores de tranquilidad. Es esencial llevar calzado adecuado, protección solar y agua.",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin florituras.",
    "footer-contact-title": "Contacto",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. Todos los derechos reservados."
  }
}
