{
  "en": {
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "selected-language": "Language ▾",
    "header-subtitle": "Discover Tenerifa Island",
    "header-title": "Top Places to Visit",
    "sortButton": "Sort Places Alphabetically",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
    "medano-title": "San Cristobal La Laguna",
    "medano-desc": "San Cristobal La Laguna, a UNESCO World Heritage site, is a town that impressed us deeply with its historic charm. Its wide cobbled streets and colorful colonial buildings bear witness to a rich past. We were transported back in time. The city is also home to numerous churches and convents, including the majestic Cathedral of Nuestra Señora de los Remedios.",
    "teresitas-title": "La Orotava",
    "teresitas-desc": "La Orotava, nestled in a fertile valley, is an architectural gem, with houses featuring finely crafted wooden balconies that bear witness to a rich colonial past. The Casa de los Balcones is a remarkable example of traditional Canarian architecture. She charmed us. The town offers a mix of gardens, churches and historic buildings.",
    "duque-title": "Masca",
    "duque-desc": "Now here’s a completely different experience. Masca is a tiny village perched in the Teno mountains. It’s the most picturesque in Tenerife. We were captivated by its spectacular location, nestled in a landscape of vertiginous gorges. In addition to the spectacular scenery, the traditional stone houses, clinging to the mountainside, are charming.",
    "jimenez-title": "Puerto de la Cruz",
    "jimenez-desc": "Puerto de la Cruz, a historic seaside resort in northern Tenerife, harmoniously combines colonial charm with modern attractions. We were seduced by the relaxed atmosphere of its historic center and waterfront. Between gardens, churches, typical houses and street art, you can sit on the terraces of many cafés to enjoy this unique mix.",
    "camison-title": "Candelaria",
    "camison-desc": "Candelaria, famous for its imposing basilica dedicated to the Virgin of Candelaria, patron saint of the Canary Islands, is an essential place of pilgrimage. It really is at the heart of the city and its culture. This oceanfront basilica is adorned with monumental statues representing the Guanche kings. We also particularly enjoyed the promenade along the waterfront, with its statues and black sandy beach.",
    "guios-title": "Vilaflor",
    "guios-desc": "Vilaflor, in the hills above Tenerife, offers a magnificent natural setting. Surrounded by pine forests, it is the ideal starting point for numerous hikes in the Teide National Park. We were charmed by the peaceful atmosphere of its narrow streets. The 17th-century church of San Pedro is the historic heart of the village. And wine lovers will appreciate the surrounding vineyards.",
    "gaviotas-title": "Garachico",
    "gaviotas-desc": "Garachico, the former capital of Tenerife, is a town that won us over with its historic charm and natural surroundings. It was rebuilt after a volcanic eruption in the 18th century. We loved the combination of the few historic buildings with the view of the cliffs and lava formations. By the sea, this creates natural pools.",
    "benijo-title": "Santa Cruz de Tenerife",
    "benijo-desc": "Santa Cruz de Tenerife, the island’s capital, is a dynamic city offering a blend of modernity and tradition. From one neighborhood to the next, the experience varies greatly. We particularly enjoyed the Tenerife auditorium, designed by Santiago Calatrava. This architectural masterpiece dominates the waterfront.",
    "bodegas-title": "Icod de los Vinos",
    "bodegas-desc": "Icod de los Vinos is famous for its thousand-year-old dragon tree. But it’s also a dynamic city with other tourist attractions, but full of locals. The historic heart of the town has well-preserved colonial buildings, and the park around the Drago Milenario offers an enchanting interlude.",
    "cueva-title": "Buenavista",
    "cueva-desc": "Buenavista is a quiet little town with colorful houses and a pretty church. Above all, it is the gateway to the Punta de Teno volcanic zone at the foot of the giant cliffs. The combination of landscapes is magnificent.",
    "tejita-title": "Tenerife Carnival",
    "tejita-desc": "Tenerife Carnival has three events that you really shouldn’t miss: the gala to select the Carnival Queen, where contestants compete in terms of glamour and imaginative costume to achieve a place of honour; the Cabalgata [Procession], in which the people take part in their finest costumes; and the Coso, the grand procession along the seafront, with carnival queens and their maids of honour, floats and music groups. A spectacular climax, and not to be missed if you want a great time."
  },
  "de": {
    "logo": "YourTrip",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Themenwechsel",
    "selected-language": "Sprache ▾",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Top Sehenswürdigkeiten",
    "sortButton": "Orte alphabetisch sortieren",
    "footer-logo": "YourTrip",
    "footer-info-title": "Teneriffa erkunden",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu entdecken — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hallo@entdecketeneriffa.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
    "medano-title": "San Cristóbal de La Laguna",
    "medano-desc": "San Cristóbal de La Laguna, ein UNESCO-Weltkulturerbe, ist eine Stadt, die uns mit ihrem historischen Charm tief beeindruckt hat. Ihre breiten Kopfsteinpflasterstraßen und bunten Kolonialgebäude zeugen von einer reichen Vergangenheit. Wir fühlten uns in eine andere Zeit versetzt. Die Stadt beherbergt auch zahlreiche Kirchen und Klöster, darunter die majestätische Kathedrale Nuestra Señora de los Remedios.",
    "teresitas-title": "La Orotava",
    "teresitas-desc": "La Orotava, eingebettet in ein fruchtbares Tal, ist ein architektonisches Juwel mit Häusern, die kunstvoll geschnitzte Holzbalkone aufweisen und von einer reichen Kolonialvergangenheit zeugen. Die Casa de los Balcones ist ein bemerkenswertes Beispiel traditioneller kanarischer Architektur. Sie hat uns verzaubert. Die Stadt bietet eine Mischung aus Gärten, Kirchen und historischen Gebäuden.",
    "duque-title": "Masca",
    "duque-desc": "Hier erwartet Sie ein völlig anderes Erlebnis. Masca ist ein winziges Dorf in den Teno-Bergen. Es ist das malerischste auf Teneriffa. Wir waren fasziniert von seiner spektakulären Lage, eingebettet in eine Landschaft aus schwindelerregenden Schluchten. Neben der atemberaubenden Landschaft sind die traditionellen Steinhäuser, die sich an den Berghang schmiegen, einfach bezaubernd.",
    "jimenez-title": "Puerto de la Cruz",
    "jimenez-desc": "Puerto de la Cruz, ein historischer Badeort im Norden Teneriffas, verbindet kolonialen Charme harmonisch mit modernen Attraktionen. Wir waren begeistert von der entspannten Atmosphäre seines historischen Zentrums und der Uferpromenade. Zwischen Gärten, Kirchen, typischen Häusern und Street Art kann man in vielen Cafés sitzen und diese einzigartige Mischung genießen.",
    "camison-title": "Candelaria",
    "camison-desc": "Candelaria, berühmt für seine imposante Basilika, die der Jungfrau von Candelaria, der Schutzpatronin der Kanarischen Inseln, gewidmet ist, ist ein wichtiger Pilgerort. Sie steht wirklich im Herzen der Stadt und ihrer Kultur. Diese Basilika am Meer ist mit monumentalen Statuen geschmückt, die die Guanchen-Könige darstellen. Besonders genossen haben wir auch den Spaziergang entlang der Uferpromenade mit ihren Statuen und dem schwarzen Sandstrand.",
    "guios-title": "Vilaflor",
    "guios-desc": "Vilaflor, in den Hügeln Teneriffas gelegen, bietet eine wunderschöne natürliche Umgebung. Umgeben von Pinienwäldern ist es der ideale Ausgangspunkt für zahlreiche Wanderungen im Teide-Nationalpark. Wir waren begeistert von der friedlichen Atmosphäre seiner engen Gassen. Die Kirche San Pedro aus dem 17. Jahrhundert ist das historische Herz des Dorfes. Und Weinliebhaber werden die umliegenden Weinberge zu schätzen wissen.",
    "gaviotas-title": "Garachico",
    "gaviotas-desc": "Garachico, die ehemalige Hauptstadt Teneriffas, ist eine Stadt, die uns mit ihrem historischen Charme und ihrer natürlichen Umgebung begeistert hat. Sie wurde nach einem Vulkanausbruch im 18. Jahrhundert wieder aufgebaut. Wir liebten die Kombination der wenigen historischen Gebäude mit dem Blick auf die Klippen und Lavafelder. Am Meer entstehen so natürliche Pools.",
    "benijo-title": "Santa Cruz de Tenerife",
    "benijo-desc": "Santa Cruz de Tenerife, die Hauptstadt der Insel, ist eine dynamische Stadt, die Moderne und Tradition verbindet. Von einem Viertel zum nächsten variiert das Erlebnis stark. Wir haben besonders das Auditorio de Tenerife, entworfen von Santiago Calatrava, genossen. Dieses architektonische Meisterwerk dominiert die Uferpromenade.",
    "bodegas-title": "Icod de los Vinos",
    "bodegas-desc": "Icod de los Vinos ist berühmt für seinen tausendjährigen Drachenbaum. Aber es ist auch eine lebendige Stadt mit anderen touristischen Attraktionen, aber voller Einheimischer. Das historische Herz der Stadt verfügt über gut erhaltene Kolonialgebäude, und der Park um den Drago Milenario bietet ein bezauberndes Intermezzo.",
    "cueva-title": "Buenavista",
    "cueva-desc": "Buenavista ist ein ruhiges Städtchen mit bunten Häusern und einer hübschen Kirche. Vor allem ist es das Tor zur vulkanischen Zone Punta de Teno am Fuße der riesigen Klippen. Die Kombination der Landschaften ist wunderschön.",
    "tejita-title": "Karneval auf Teneriffa",
    "tejita-desc": "Der Karneval auf Teneriffa hat drei Ereignisse, die Sie wirklich nicht verpassen sollten: die Gala zur Wahl der Karnevalskönigin, bei der die Teilnehmerinnen um Glamour und einfallsreiche Kostüme wetteifern, um einen Ehrenplatz zu erhalten; die Cabalgata [Umzug], bei der die Menschen in ihren schönsten Kostümen teilnehmen; und der Coso, der große Umzug entlang der Uferpromenade mit Karnevalsköniginnen, Hofdamen, Festwagen und Musikgruppen. Ein spektakulärer Höhepunkt, den Sie nicht verpassen sollten, wenn Sie eine tolle Zeit haben möchten."
  },
  "es": {
    "logo": "YourTrip",
    "home-link": "Inicio",
    "about-link": "Sobre nosotros",
    "faq-link": "Cambiar tema",
    "selected-language": "Idioma ▾",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Los mejores lugares para visitar",
    "sortButton": "Ordenar lugares alfabéticamente",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía definitiva de la isla, sin rodeos.",
    "footer-contact-title": "Contacto",
    "footer-email": "hola@exploratenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
    "medano-title": "San Cristóbal de La Laguna",
    "medano-desc": "San Cristóbal de La Laguna, Patrimonio de la Humanidad por la UNESCO, es una ciudad que nos impresionó profundamente con su encanto histórico. Sus calles empedradas y coloridos edificios coloniales dan testimonio de un pasado rico. Nos transportamos a otra época. La ciudad también alberga numerosas iglesias y conventos, incluida la majestuosa Catedral de Nuestra Señora de los Remedios.",
    "teresitas-title": "La Orotava",
    "teresitas-desc": "La Orotava, enclavada en un valle fértil, es una joya arquitectónica, con casas que presentan balcones de madera finamente tallados que dan testimonio de un rico pasado colonial. La Casa de los Balcones es un ejemplo notable de la arquitectura tradicional canaria. Nos encantó. El pueblo ofrece una mezcla de jardines, iglesias y edificios históricos.",
    "duque-title": "Masca",
    "duque-desc": "Aquí tienes una experiencia completamente diferente. Masca es un pequeño pueblo encaramado en las montañas de Teno. Es el más pintoresco de Tenerife. Nos cautivó su ubicación espectacular, enclavado en un paisaje de gargantas vertiginosas. Además del paisaje espectacular, las casas tradicionales de piedra, aferradas a la ladera de la montaña, son encantadoras.",
    "jimenez-title": "Puerto de la Cruz",
    "jimenez-desc": "Puerto de la Cruz, un histórico balneario marítimo en el norte de Tenerife, combina armoniosamente el encanto colonial con atracciones modernas. Nos sedujo el ambiente relajado de su centro histórico y el paseo marítimo. Entre jardines, iglesias, casas típicas y arte callejero, puedes sentarte en las terrazas de muchos cafés para disfrutar de esta mezcla única.",
    "camison-title": "Candelaria",
    "camison-desc": "Candelaria, famosa por su imponente basílica dedicada a la Virgen de Candelaria, patrona de las Islas Canarias, es un lugar de peregrinación esencial. Realmente está en el corazón de la ciudad y su cultura. Esta basílica frente al mar está adornada con estatuas monumentales que representan a los reyes guanches. También disfrutamos especialmente del paseo junto al mar, con sus estatuas y playa de arena negra.",
    "guios-title": "Vilaflor",
    "guios-desc": "Vilaflor, en las colinas de Tenerife, ofrece un magnífico entorno natural. Rodeado de bosques de pinos, es el punto de partida ideal para numerosas caminatas en el Parque Nacional del Teide. Nos encantó el ambiente tranquilo de sus calles estrechas. La iglesia de San Pedro del siglo XVII es el corazón histórico del pueblo. Y los amantes del vino apreciarán los viñedos circundantes.",
    "gaviotas-title": "Garachico",
    "gaviotas-desc": "Garachico, la antigua capital de Tenerife, es un pueblo que nos conquistó con su encanto histórico y su entorno natural. Fue reconstruido después de una erupción volcánica en el siglo XVIII. Nos encantó la combinación de los pocos edificios históricos con la vista de los acantilados y formaciones de lava. Junto al mar, esto crea piscinas naturales.",
    "benijo-title": "Santa Cruz de Tenerife",
    "benijo-desc": "Santa Cruz de Tenerife, la capital de la isla, es una ciudad dinámica que ofrece una mezcla de modernidad y tradición. De un barrio a otro, la experiencia varía mucho. Disfrutamos especialmente del Auditorio de Tenerife, diseñado por Santiago Calatrava. Esta obra maestra arquitectónica domina el paseo marítimo.",
    "bodegas-title": "Icod de los Vinos",
    "bodegas-desc": "Icod de los Vinos es famoso por su drago milenario. Pero también es una ciudad dinámica con otras atracciones turísticas, pero llena de lugareños. El corazón histórico del pueblo tiene edificios coloniales bien conservados, y el parque alrededor del Drago Milenario ofrece un interludio encantador.",
    "cueva-title": "Buenavista",
    "cueva-desc": "Buenavista es un pequeño pueblo tranquilo con casas coloridas y una bonita iglesia. Sobre todo, es la puerta de entrada a la zona volcánica de Punta de Teno al pie de los gigantescos acantilados. La combinación de paisajes es magnífica.",
    "tejita-title": "Carnaval de Tenerife",
    "tejita-desc": "El Carnaval de Tenerife tiene tres eventos que realmente no te debes perder: la gala para elegir a la Reina del Carnaval, donde las concursantes compiten en glamour y trajes imaginativos para lograr un lugar de honor; la Cabalgata, en la que la gente participa con sus mejores disfraces; y el Coso, el gran desfile frente al mar, con reinas del carnaval y sus damas de honor, carrozas y grupos musicales. Un clímax espectacular, y no te lo pierdas si quieres pasar un gran momento."
  }
}
