{
  "en": {
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "selected-language": "Language ▾",
    "header-subtitle": "Discover Tenerifa Island",
    "header-title": "Top beaches on Tenerife",
    "filterDropdownButton": "Filter",
    "filter-all": "Show All",
    "filter-yes": "With Infrastructure",
    "filter-no": "Without Infrastructure",
    "sortButton": "Sort Beaches Alphabetically",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best spots — beaches, hikes, restaurants, and hidden gems — all in one place. Just your ultimate island guide, no fluff.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
    "medano-title": "El Médano",
    "medano-desc": "A popular destination for its ideal wind conditions, Playa del Médano is a renowned spot for water sports. With its fine sand and shallow waters, it's ideal for families and thrill-seekers alike. We loved the stunning view of Montaña Roja. It's a beach that invites relaxation and contemplation.",
    "teresitas-title": "Las Teresitas",
    "teresitas-desc": "This magnificent beach of golden sand imported from the Sahara, stretching for almost a kilometer, is one of the region's jewels. We particularly appreciate its gentle, gradual slope as you enter the water. It's perfect for a family outing with swimming, water polo, beach volleyball, pedal boats and other modern facilities.",
    "duque-title": "Duque",
    "duque-desc": "Fine golden sand and calm turquoise waters: this well-kept beach offers a luxurious setting, surrounded by high-end hotels and chic boutiques. This beautiful extended beach is divided into 2: Playa del Duque North and Playa del Duque South. It is well equipped.",
    "jimenez-title": "Jiménez",
    "jimenez-desc": "Playa Jimenez is our favorite in Puerto de la Cruz. It is the furthest from the center. You can recognize it by the colorful facades at the end of the promenade overlooking it. We went there in the early hours of the morning and really appreciated its peaceful atmosphere.",
    "camison-title": "Del Camison",
    "camison-desc": "Playa del Camison pleasantly surprised us with its charm. This small beach of golden sand, nestled between two rocky promontories, offers calm, crystal-clear waters. We appreciated its family atmosphere and proximity to amenities, while remaining away from the hustle and bustle of the big seaside resorts.",
    "guios-title": "Los Guios",
    "guios-desc": "Located at the foot of the impressive Los Gigantes cliffs, Playa de Los Guios offers a breathtaking setting. We were fascinated by the volcanic rock walls overlooking the beach. One section was closed at the time of our visit due to falling rocks. Playa de Los Guyos is also the ideal starting point for water sports activities.",
    "gaviotas-title": "Las Gaviotas",
    "gaviotas-desc": "This beautiful black sand beach is a little corner of paradise surrounded by impressive cliffs. We were won over by the natural, unspoilt setting of Playa de Las Gaviotas. Although the TF-121 road leading to it is narrow and winding, it's well worth the detour. We fell under the spell of this haven of peace, cut off from the world.",
    "benijo-title": "Benijo",
    "benijo-desc": "Playa del Benijo seduced us with its wild beauty and secluded atmosphere. This black sand and pebble beach offers breathtaking scenery with its spectacular rock formations and sculpted cliffs.",
    "bodegas-title": "Roque de las Bodeguas",
    "bodegas-desc": "In the Anaga massif, we were really seduced by this wild beach with its deep black sand, a far cry from the touristy beaches of the south. On one side the view of the Anaga cliffs, on the other a rocky promontory that gives it its name.",
    "cueva-title": "Cueva del Agua",
    "cueva-desc": "This secluded beach, to the east of Playa de La Gaviotas, is one of our favorites hidden away in the Anaga massif. We were seduced by its fine black sand and natural charm. Although unsupervised and unequipped, it offers good swimming conditions.",
    "tejita-title": "Tejita",
    "tejita-desc": "Playa de la Tejita won us over with its natural, unspoilt character. One of Tenerife's largest natural beaches, this long golden sandy beach offers a spectacular setting with the Roja mountain in the background."
  },
  "de": {
    "logo": "IhreReise",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Themenwechsel",
    "selected-language": "Sprache ▾",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Die besten Strände auf Teneriffa",
    "filterDropdownButton": "Filter",
    "filter-all": "Alle anzeigen",
    "filter-yes": "Mit Infrastruktur",
    "filter-no": "Ohne Infrastruktur",
    "sortButton": "Strände alphabetisch sortieren",
    "footer-logo": "IhreReise",
    "footer-info-title": "Teneriffa erkunden",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Orte Teneriffas zu erkunden — Strände, Wanderungen, Restaurants und versteckte Juwelen — alles an einem Ort. Einfach Ihr ultimativer Inselführer, ohne Schnickschnack.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hallo@entdecketeneriffa.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
    "medano-title": "El Médano",
    "medano-desc": "Ein beliebtes Ziel aufgrund seiner idealen Windverhältnisse ist Playa del Médano, ein bekannter Ort für Wassersport. Mit seinem feinen Sand und flachen Wasser ist er ideal für Familien und Abenteurer gleichermaßen. Wir liebten den atemberaubenden Blick auf den Montaña Roja. Es ist ein Strand, der zur Entspannung und Besinnung einlädt.",
    "teresitas-title": "Las Teresitas",
    "teresitas-desc": "Dieser prächtige Strand mit goldenem Sand aus der Sahara, der sich fast einen Kilometer erstreckt, ist eines der Juwelen der Region. Wir schätzen besonders den sanften, allmählichen Abfall beim Betreten des Wassers. Er ist perfekt für einen Familienausflug mit Schwimmen, Wasserball, Beachvolleyball, Tretbooten und anderen modernen Einrichtungen.",
    "duque-title": "Duque",
    "duque-desc": "Feiner goldener Sand und ruhiges türkisfarbenes Wasser: Dieser gepflegte Strand bietet eine luxuriöse Umgebung, umgeben von erstklassigen Hotels und schicken Boutiquen. Dieser schöne, weitläufige Strand ist in zwei Teile geteilt: Playa del Duque Norte und Playa del Duque Sur. Er ist gut ausgestattet.",
    "jimenez-title": "Jiménez",
    "jimenez-desc": "Playa Jimenez ist unser Favorit in Puerto de la Cruz. Es ist der am weitesten vom Zentrum entfernte Strand. Man erkennt ihn an den bunten Fassaden am Ende der Promenade mit Blick darauf. Wir waren in den frühen Morgenstunden dort und schätzten die friedliche Atmosphäre sehr.",
    "camison-title": "Del Camison",
    "camison-desc": "Playa del Camison hat uns angenehm mit ihrem Charme überrascht. Dieser kleine Strand mit goldenem Sand, eingebettet zwischen zwei felsigen Landspitzen, bietet ruhiges, kristallklares Wasser. Wir schätzten das Familienambiente und die Nähe zu Annehmlichkeiten, während er dennoch abseits des Trubels der großen Badeorte liegt.",
    "guios-title": "Los Guios",
    "guios-desc": "Am Fuße der beeindruckenden Los Gigantes-Klippen gelegen, bietet Playa de Los Guios eine atemberaubende Kulisse. Wir waren fasziniert von den vulkanischen Felswänden, die den Strand überragen. Ein Abschnitt war zum Zeitpunkt unseres Besuchs wegen Steinschlags gesperrt. Playa de Los Guyos ist auch der ideale Ausgangspunkt für Wassersportaktivitäten.",
    "gaviotas-title": "Las Gaviotas",
    "gaviotas-desc": "Dieser schöne schwarze Sandstrand ist ein kleines Paradies, umgeben von beeindruckenden Klippen. Wir waren begeistert von der natürlichen, unberührten Umgebung der Playa de Las Gaviotas. Obwohl die TF-121-Straße dorthin schmal und kurvenreich ist, lohnt sich der Umweg. Wir verfielen dem Zauber dieses friedlichen Ortes, abgeschnitten von der Welt.",
    "benijo-title": "Benijo",
    "benijo-desc": "Playa del Benijo hat uns mit seiner wilden Schönheit und abgeschiedenen Atmosphäre verzaubert. Dieser schwarze Sand- und Kieselstrand bietet atemberaubende Landschaften mit spektakulären Felsformationen und geformten Klippen.",
    "bodegas-title": "Roque de las Bodeguas",
    "bodegas-desc": "Im Anaga-Gebirge waren wir wirklich verzaubert von diesem wilden Strand mit seinem tiefschwarzen Sand, weit entfernt von den touristischen Stränden des Südens. Auf der einen Seite der Blick auf die Anaga-Klippen, auf der anderen ein felsiges Vorgebirge, das ihm seinen Namen gibt.",
    "cueva-title": "Cueva del Agua",
    "cueva-desc": "Dieser abgelegene Strand östlich der Playa de La Gaviotas ist einer unserer Favoriten, versteckt im Anaga-Gebirge. Wir waren begeistert von seinem feinen schwarzen Sand und natürlichen Charme. Obwohl unbeaufsichtigt und ohne Ausstattung, bietet er gute Badebedingungen.",
    "tejita-title": "Tejita",
    "tejita-desc": "Playa de la Tejita hat uns mit ihrem natürlichen, unberührten Charakter überzeugt. Einer der größten Naturstrände Teneriffas, dieser lange goldene Sandstrand bietet eine spektakuläre Kulisse mit dem Berg Roja im Hintergrund."
  },
  "es": {
    "logo": "TuViaje",
    "home-link": "Inicio",
    "about-link": "Acerca de",
    "faq-link": "Cambiar tema",
    "selected-language": "Idioma ▾",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Las mejores playas de Tenerife",
    "filterDropdownButton": "Filtrar",
    "filter-all": "Mostrar todo",
    "filter-yes": "Con infraestructura",
    "filter-no": "Sin infraestructura",
    "sortButton": "Ordenar playas alfabéticamente",
    "footer-logo": "TuViaje",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores lugares de Tenerife — playas, senderos, restaurantes y joyas ocultas — todo en un solo lugar. Simplemente tu guía insular definitiva, sin florituras.",
    "footer-contact-title": "Contacto",
    "footer-email": "hola@exploratenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
    "medano-title": "El Médano",
    "medano-desc": "Un destino popular por sus condiciones de viento ideales, Playa del Médano es un lugar reconocido para deportes acuáticos. Con su arena fina y aguas poco profundas, es ideal tanto para familias como para buscadores de emociones. Nos encantó la impresionante vista del Montaña Roja. Es una playa que invita a la relajación y la contemplación.",
    "teresitas-title": "Las Teresitas",
    "teresitas-desc": "Esta magnífica playa de arena dorada importada del Sáhara, que se extiende casi un kilómetro, es una de las joyas de la región. Apreciamos especialmente su suave pendiente gradual al entrar al agua. Es perfecta para una salida familiar con natación, waterpolo, voleibol playero, pedales y otras instalaciones modernas.",
    "duque-title": "Duque",
    "duque-desc": "Arena fina dorada y aguas turquesas tranquilas: esta playa bien cuidada ofrece un entorno lujoso, rodeado de hoteles de alta gama y boutiques elegantes. Esta hermosa playa extendida se divide en 2: Playa del Duque Norte y Playa del Duque Sur. Está bien equipada.",
    "jimenez-title": "Jiménez",
    "jimenez-desc": "Playa Jimenez es nuestra favorita en Puerto de la Cruz. Es la más alejada del centro. Puedes reconocerla por las fachadas coloridas al final del paseo marítimo que la rodea. Fuimos allí en las primeras horas de la mañana y realmente apreciamos su ambiente tranquilo.",
    "camison-title": "Del Camison",
    "camison-desc": "Playa del Camison nos sorprendió gratamente con su encanto. Esta pequeña playa de arena dorada, enclavada entre dos promontorios rocosos, ofrece aguas tranquilas y cristalinas. Apreciamos su ambiente familiar y cercanía a los servicios, manteniéndose alejada del bullicio de los grandes complejos turísticos.",
    "guios-title": "Los Guios",
    "guios-desc": "Situada al pie de los impresionantes acantilados de Los Gigantes, Playa de Los Guios ofrece un entorno impresionante. Nos fascinaron las paredes de roca volcánica que dominan la playa. Una sección estaba cerrada durante nuestra visita debido a desprendimientos de rocas. Playa de Los Guyos es también el punto de partida ideal para actividades deportivas acuáticas.",
    "gaviotas-title": "Las Gaviotas",
    "gaviotas-desc": "Esta hermosa playa de arena negra es un pequeño rincón del paraíso rodeado de impresionantes acantilados. Nos conquistó el entorno natural y virgen de Playa de Las Gaviotas. Aunque la carretera TF-121 que lleva hasta ella es estrecha y sinuosa, merece la pena el desvío. Caímos bajo el hechizo de este remanso de paz, aislado del mundo.",
    "benijo-title": "Benijo",
    "benijo-desc": "Playa del Benijo nos sedujo con su belleza salvaje y ambiente apartado. Esta playa de arena negra y guijarros ofrece paisajes impresionantes con sus espectaculares formaciones rocosas y acantilados esculpidos.",
    "bodegas-title": "Roque de las Bodegas",
    "bodegas-desc": "En el macizo de Anaga, quedamos realmente seducidos por esta playa salvaje con su arena negra profunda, muy lejos de las playas turísticas del sur. Por un lado la vista de los acantilados de Anaga, por el otro un promontorio rocoso que le da su nombre.",
    "cueva-title": "Cueva del Agua",
    "cueva-desc": "Esta playa apartada, al este de Playa de La Gaviotas, es una de nuestras favoritas escondidas en el macizo de Anaga. Nos sedujo su arena negra fina y encanto natural. Aunque no está vigilada ni equipada, ofrece buenas condiciones para nadar.",
    "tejita-title": "Tejita",
    "tejita-desc": "Playa de la Tejita nos conquistó con su carácter natural y virgen. Una de las playas naturales más grandes de Tenerife, esta larga playa de arena dorada ofrece un escenario espectacular con la montaña Roja al fondo."
  }
}
