{
  "en": {
    "logo": "YourTrip",
    "home-link": "Home",
    "about-link": "About",
    "faq-link": "Theme Switch",
    "selected-language": "Language ▾",
    "header-subtitle": "Discover Tenerife Island",
    "header-title": "Top Hiking Trails on Tenerife",
    "filterDropdownButton": "Filter",
    "filter-all": "Show All",
    "filter-yes": "Hard Trails",
    "filter-no": "Moderate Trails",
    "sortButton": "Sort Trails Alphabetically",
    "footer-logo": "YourTrip",
    "footer-info-title": "Explore Tenerife",
    "footer-info-description": "This website was made to help you explore Tenerife's best hiking trails — from volcanic landscapes to lush forests — all in one place. Your ultimate hiking guide to the island.",
    "footer-contact-title": "Contact",
    "footer-email": "hello@exploretenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explore Tenerife. All rights reserved.",
    "moderate": "Moderate",
    "hard": "Hard",
    "length": "Length",
    "elevation": "Elevation",
    "moderate1": "Moderate",
    "hard1": "Hard",
    "length1": "Length",
    "elevation1": "Elevation",
    "moderate2": "Moderate",
    "hard2": "Hard",
    "length2": "Length",
    "elevation2": "Elevation",
    "moderate3": "Moderate",
    "hard3": "Hard",
    "length3": "Length",
    "elevation3": "Elevation",
    "moderate4": "Moderate",
    "hard4": "Hard",
    "length4": "Length",
    "elevation4": "Elevation",
    "moderate5": "Moderate",
    "hard5": "Hard",
    "length5": "Length",
    "elevation5": "Elevation",
    "moderate6": "Moderate",
    "hard6": "Hard",
    "length6": "Length",
    "elevation6": "Elevation",
    "moderate7": "Moderate",
    "hard7": "Hard",
    "length7": "Length",
    "elevation7": "Elevation",
    "moderate8": "Moderate",
    "hard8": "Hard",
    "length8": "Length",
    "elevation8": "Elevation",
    "moderate9": "Moderate",
    "hard9": "Hard",
    "length9": "Length",
    "elevation9": "Elevation",
    "moderate10": "Moderate",
    "hard10": "Hard",
    "length10": "Length",
    "elevation10": "Elevation",
    "medano-title": "Roques de García",
    "medano-desc": "Discover this 3.4-km loop trail near Vilaflor, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime. Dogs are welcome, but must be on a leash.",
    "teresitas-title": "Chinyero Volcano",
    "teresitas-desc": "Discover this 8.2-km loop trail near Santiago del Teide, Tenerife. Generally considered a moderately challenging route, it takes an average of 2 h 15 min to complete. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "duque-title": "Cruz del Draguillo",
    "duque-desc": "Experience this 5.1-km loop trail near Santa Cruz de Tenerife, Tenerife. Generally considered a challenging route, it takes an average of 2 h 33 min to complete. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime. Dogs are welcome and may be off-leash in some areas.",
    "jimenez-title": "Montaña Blanca",
    "jimenez-desc": "Discover this 10.9-km point-to-point trail near El Portillo, Tenerife. Generally considered a challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "camison-title": "Chinamada",
    "camison-desc": "Experience this 7.6-km loop trail near San Cristóbal de La Laguna, Tenerife. Generally considered a moderately challenging route, it takes an average of 2 h 35 min to complete. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The best times to visit this trail are November through May.",
    "guios-title": "Mount Guajara",
    "guios-desc": "Head out on this 11.1-km loop trail near Vilaflor, Tenerife. Generally considered a challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "gaviotas-title": "Hidalgo Point",
    "gaviotas-desc": "Experience this 9.5-km out-and-back trail near Tegueste, Tenerife. Generally considered a challenging route, it takes an average of 4 h 0 min to complete. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "benijo-title": "Callejón de Teno",
    "benijo-desc": "Head out on this 10.0-km loop trail near Buenavista del Norte, Tenerife. Generally considered a moderately challenging route. This is a very popular area for birding and hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "bodegas-title": "Taborno Rock",
    "bodegas-desc": "Get to know this 3.9-km loop trail near Santa Cruz de Tenerife, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "cueva-title": "Sendero de los Sentidos",
    "cueva-desc": "Head out on this 1.3-km loop trail near Tegueste, Tenerife. Generally considered a moderately challenging route, it takes an average of 31 min to complete. This is a very popular area for walking, so you'll likely encounter other people while exploring. The trail is open year-round and is beautiful to visit anytime.",
    "tejita-title": "Santiago del Teide",
    "tejita-desc": "Check out this 8.9-km point-to-point trail near Santiago del Teide, Tenerife. Generally considered a moderately challenging route. This is a very popular area for hiking, so you'll likely encounter other people while exploring. The best times to visit this trail are November through April."
  },
  "de": {
    "logo": "IhreReise",
    "home-link": "Startseite",
    "about-link": "Über uns",
    "faq-link": "Themenwechsel",
    "selected-language": "Sprache ▾",
    "header-subtitle": "Entdecken Sie die Insel Teneriffa",
    "header-title": "Die besten Wanderwege auf Teneriffa",
    "filterDropdownButton": "Filter",
    "filter-all": "Alle anzeigen",
    "filter-yes": "Schwierige Wanderwege",
    "filter-no": "Mittelschwere Wanderwege",
    "sortButton": "Wanderwege alphabetisch sortieren",
    "footer-logo": "IhreReise",
    "footer-info-title": "Teneriffa erkunden",
    "footer-info-description": "Diese Website wurde erstellt, um Ihnen zu helfen, die besten Wanderwege Teneriffas zu erkunden — von vulkanischen Landschaften bis zu üppigen Wäldern — alles an einem Ort. Ihr ultimativer Wanderführer für die Insel.",
    "footer-contact-title": "Kontakt",
    "footer-email": "hallo@entdecketeneriffa.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Entdecke Teneriffa. Alle Rechte vorbehalten.",
    "moderate": "Mittel",
    "hard": "Schwer",
    "length": "Länge",
    "elevation": "Höhenunterschied",
    "moderate1": "Mittel",
    "hard1": "Schwer",
    "length1": "Länge",
    "elevation1": "Höhenunterschied",
    "moderate2": "Mittel",
    "hard2": "Schwer",
    "length2": "Länge",
    "elevation2": "Höhenunterschied",
    "moderate3": "Mittel",
    "hard3": "Schwer",
    "length3": "Länge",
    "elevation3": "Höhenunterschied",
    "moderate4": "Mittel",
    "hard4": "Schwer",
    "length4": "Länge",
    "elevation4": "Höhenunterschied",
    "moderate5": "Mittel",
    "hard5": "Schwer",
    "length5": "Länge",
    "elevation5": "Höhenunterschied",
    "moderate6": "Mittel",
    "hard6": "Schwer",
    "length6": "Länge",
    "elevation6": "Höhenunterschied",
    "moderate7": "Mittel",
    "hard7": "Schwer",
    "length7": "Länge",
    "elevation7": "Höhenunterschied",
    "moderate8": "Mittel",
    "hard8": "Schwer",
    "length8": "Länge",
    "elevation8": "Höhenunterschied",
    "moderate9": "Mittel",
    "hard9": "Schwer",
    "length9": "Länge",
    "elevation9": "Höhenunterschied",
    "moderate10": "Mittel",
    "hard10": "Schwer",
    "length10": "Länge",
    "elevation10": "Höhenunterschied",
    "medano-title": "Roques de García",
    "medano-desc": "Entdecken Sie diesen 3,4 km langen Rundweg in der Nähe von Vilaflor, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen. Hunde sind erlaubt, müssen aber an der Leine geführt werden.",
    "teresitas-title": "Chinyero Vulkan",
    "teresitas-desc": "Entdecken Sie diesen 8,2 km langen Rundweg in der Nähe von Santiago del Teide, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 15 Minuten. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "duque-title": "Cruz del Draguillo",
    "duque-desc": "Erleben Sie diesen 5,1 km langen Rundweg in der Nähe von Santa Cruz de Tenerife, Teneriffa. Allgemein als anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 33 Minuten. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen. Hunde sind erlaubt und dürfen in einigen Bereichen ohne Leine laufen.",
    "jimenez-title": "Montaña Blanca",
    "jimenez-desc": "Entdecken Sie diesen 10,9 km langen Streckenweg in der Nähe von El Portillo, Teneriffa. Allgemein als anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "camison-title": "Chinamada",
    "camison-desc": "Erleben Sie diesen 7,6 km langen Rundweg in der Nähe von San Cristóbal de La Laguna, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 2 Stunden 35 Minuten. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Die beste Zeit für diesen Weg ist von November bis Mai.",
    "guios-title": "Mount Guajara",
    "guios-desc": "Begeben Sie sich auf diesen 11,1 km langen Rundweg in der Nähe von Vilaflor, Teneriffa. Allgemein als anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "gaviotas-title": "Hidalgo Point",
    "gaviotas-desc": "Erleben Sie diesen 9,5 km langen Hin- und Rückweg in der Nähe von Tegueste, Teneriffa. Allgemein als anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 4 Stunden. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "benijo-title": "Callejón de Teno",
    "benijo-desc": "Begeben Sie sich auf diesen 10,0 km langen Rundweg in der Nähe von Buenavista del Norte, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Gebiet für Vogelbeobachtung und Wandern, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "bodegas-title": "Taborno Rock",
    "bodegas-desc": "Lernen Sie diesen 3,9 km langen Rundweg in der Nähe von Santa Cruz de Tenerife, Teneriffa kennen. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "cueva-title": "Sendero de los Sentidos",
    "cueva-desc": "Begeben Sie sich auf diesen 1,3 km langen Rundweg in der Nähe von Tegueste, Teneriffa. Allgemein als mäßig anspruchsvoll eingestuft, dauert die Strecke durchschnittlich 31 Minuten. Dies ist ein sehr beliebtes Gebiet zum Spazierengehen, daher werden Sie wahrscheinlich anderen Menschen begegnen. Der Weg ist das ganze Jahr über geöffnet und jederzeit schön zu besuchen.",
    "tejita-title": "Santiago del Teide",
    "tejita-desc": "Sehen Sie sich diesen 8,9 km langen Streckenweg in der Nähe von Santiago del Teide, Teneriffa an. Allgemein als mäßig anspruchsvoll eingestuft. Dies ist ein sehr beliebtes Wandergebiet, daher werden Sie wahrscheinlich anderen Menschen begegnen. Die beste Zeit für diesen Weg ist von November bis April."
  },
  "es": {
    "logo": "TuViaje",
    "home-link": "Inicio",
    "about-link": "Acerca de",
    "faq-link": "Cambiar tema",
    "selected-language": "Idioma ▾",
    "header-subtitle": "Descubre la isla de Tenerife",
    "header-title": "Los mejores senderos de Tenerife",
    "filterDropdownButton": "Filtrar",
    "filter-all": "Mostrar todo",
    "filter-yes": "Rutas difíciles",
    "filter-no": "Rutas moderadas",
    "sortButton": "Ordenar senderos alfabéticamente",
    "footer-logo": "TuViaje",
    "footer-info-title": "Explora Tenerife",
    "footer-info-description": "Este sitio web fue creado para ayudarte a explorar los mejores senderos de Tenerife — desde paisajes volcánicos hasta frondosos bosques — todo en un solo lugar. Tu guía definitiva de senderismo en la isla.",
    "footer-contact-title": "Contacto",
    "footer-email": "hola@exploratenerife.com",
    "footer-instagram": "Instagram",
    "footer-facebook": "Facebook",
    "footer-copyright": "© 2025 Explora Tenerife. Todos los derechos reservados.",
    "moderate": "Moderado",
    "hard": "Difícil",
    "length": "Longitud",
    "elevation": "Desnivel",
    "moderate1": "Moderado",
    "hard1": "Difícil",
    "length1": "Longitud",
    "elevation1": "Desnivel",
    "moderate2": "Moderado",
    "hard2": "Difícil",
    "length2": "Longitud",
    "elevation2": "Desnivel",
    "moderate3": "Moderado",
    "hard3": "Difícil",
    "length3": "Longitud",
    "elevation3": "Desnivel",
    "moderate4": "Moderado",
    "hard4": "Difícil",
    "length4": "Longitud",
    "elevation4": "Desnivel",
    "moderate5": "Moderado",
    "hard5": "Difícil",
    "length5": "Longitud",
    "elevation5": "Desnivel",
    "moderate6": "Moderado",
    "hard6": "Difícil",
    "length6": "Longitud",
    "elevation6": "Desnivel",
    "moderate7": "Moderado",
    "hard7": "Difícil",
    "length7": "Longitud",
    "elevation7": "Desnivel",
    "moderate8": "Moderado",
    "hard8": "Difícil",
    "length8": "Longitud",
    "elevation8": "Desnivel",
    "moderate9": "Moderado",
    "hard9": "Difícil",
    "length9": "Longitud",
    "elevation9": "Desnivel",
    "moderate10": "Moderado",
    "hard10": "Difícil",
    "length10": "Longitud",
    "elevation10": "Desnivel",
    "medano-title": "Roques de García",
    "medano-desc": "Descubre este sendero circular de 3,4 km cerca de Vilaflor, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento. Se permiten perros, pero deben ir con correa.",
    "teresitas-title": "Volcán Chinyero",
    "teresitas-desc": "Descubre este sendero circular de 8,2 km cerca de Santiago del Teide, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 2 horas y 15 minutos en completarla. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "duque-title": "Cruz del Draguillo",
    "duque-desc": "Experimenta este sendero circular de 5,1 km cerca de Santa Cruz de Tenerife, Tenerife. Generalmente considerado como una ruta desafiante, se tarda una media de 2 horas y 33 minutos en completarla. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento. Se permiten perros y pueden estar sin correa en algunas áreas.",
    "jimenez-title": "Montaña Blanca",
    "jimenez-desc": "Descubre este sendero de punto a punto de 10,9 km cerca de El Portillo, Tenerife. Generalmente considerado como una ruta desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "camison-title": "Chinamada",
    "camison-desc": "Experimenta este sendero circular de 7,6 km cerca de San Cristóbal de La Laguna, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 2 horas y 35 minutos en completarla. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. Los mejores momentos para visitar este sendero son de noviembre a mayo.",
    "guios-title": "Mount Guajara",
    "guios-desc": "Adéntrate en este sendero circular de 11,1 km cerca de Vilaflor, Tenerife. Generalmente considerado como una ruta desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "gaviotas-title": "Hidalgo Point",
    "gaviotas-desc": "Experimenta este sendero de ida y vuelta de 9,5 km cerca de Tegueste, Tenerife. Generalmente considerado como una ruta desafiante, se tarda una media de 4 horas en completarla. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "benijo-title": "Callejón de Teno",
    "benijo-desc": "Adéntrate en este sendero circular de 10,0 km cerca de Buenavista del Norte, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para la observación de aves y el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "bodegas-title": "Taborno Rock",
    "bodegas-desc": "Conoce este sendero circular de 3,9 km cerca de Santa Cruz de Tenerife, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "cueva-title": "Sendero de los Sentidos",
    "cueva-desc": "Adéntrate en este sendero circular de 1,3 km cerca de Tegueste, Tenerife. Generalmente considerado como una ruta moderadamente desafiante, se tarda una media de 31 minutos en completarla. Esta es un área muy popular para caminar, por lo que es probable que encuentres a otras personas mientras exploras. El sendero está abierto todo el año y es hermoso para visitar en cualquier momento.",
    "tejita-title": "Santiago del Teide",
    "tejita-desc": "Echa un vistazo a este sendero de punto a punto de 8,9 km cerca de Santiago del Teide, Tenerife. Generalmente considerado como una ruta moderadamente desafiante. Esta es un área muy popular para el senderismo, por lo que es probable que encuentres a otras personas mientras exploras. Los mejores momentos para visitar este sendero son de noviembre a abril."
  }
}
